Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-programming.Rmd-*.po
Languages: fr

source: In data.table, we make it easier by automatically *enlist*-ing a list of objects into a list call with those objects. This means that any `list` object inside the `env` list argument will be turned into list `call`, making the API for that use case as simple as presented below.
fr: Dans data.table, nous facilitons les choses en transformant automatiquement en liste une liste d'objets en un appel de liste avec ces objets. Cela signifie que tout objet `list` à l'intérieur de l'argument `env` list sera transformé en `call` list, rendant l'API pour ce cas d'utilisation aussi simple que présenté ci-dessous.

source: #===== r splice_datatable # this works DT[, j, env = list(j = as.list(cols)), verbose = TRUE] # this will not work #DT[, list(cols), # env = list(cols = cols)]
fr: #===== r splice_datable # cela fonctionne DT[, j, env = list(j = as.list(cols)), verbose = TRUE] # cela ne fonctionnera pas #DT[, list(cols), # env = list(cols = cols)]

source: It is important to provide a call to `as.list`, rather than simply a list, inside the `env` list argument, as is shown in the above example.
fr: Il est important de fournir un appel à `as.list`, plutôt qu'une simple liste, à l'intérieur de l'argument list de `env`, comme le montre l'exemple ci-dessus.

source: Let's explore *enlist*-ing in more detail.
fr: Examinons plus en détail la question de l'ajout à la liste ('*enlist*-ing').

source: #===== r splice_enlist DT[, j, # data.table automatically enlists nested lists into list calls env = list(j = as.list(cols)), verbose = TRUE] DT[, j, # turning the above 'j' list into a list call env = list(j = quote(list(Sepal.Length, Sepal.Width))), verbose = TRUE] DT[, j, # the same as above but accepts character vector env = list(j = as.call(c(quote(list), lapply(cols, as.name)))), verbose = TRUE]
fr: #===== r splice_enlist DT[, j, # data.table met automatiquement en liste les listes imbriquées dans des appels de liste env = list(j = as.list(cols)), verbose = TRUE] DT[, j, # transformer la liste 'j' ci-dessus en un appel de liste env = list(j = quote(list(Sepal.Length, Sepal.Width))), verbose = TRUE] DT[, j, # la même chose que ci-dessus mais accepte un vecteur de caractères env = list(j = as.call(c(quote(list), lapply(cols, as.name)))), verbose = TRUE]

source: Now let's try to pass a list of symbols, rather than list call to those symbols. We'll use `I()` to escape automatic *enlist*-ing but, as this will also turn off character to symbol conversion, we also have to use `as.name`.
fr: Essayons maintenant de passer une liste de symboles, plutôt qu'un appel de liste à ces symboles. Nous utiliserons `I()` pour échapper à la mise en liste (*enlist*-ing) automatique, mais comme cela désactivera aussi la conversion des caractères en symboles, nous devrons aussi utiliser `as.name`.

source: #===== r splice_not, error=TRUE, purl=FALSE DT[, j, # list of symbols env = I(list(j = lapply(cols, as.name))), verbose = TRUE] DT[, j, # again the proper way, enlist list to list call automatically env = list(j = as.list(cols)), verbose = TRUE]
fr: #===== r splice_not, error=TRUE, purl=FALSE DT[, j, # liste de symboles env = I(list(j = lapply(cols, as.name))), verbose = VRAI] DT[, j, # encore une fois de la meilleure façon, ajout automatique de la liste à l'appel de liste env = list(j = as.list(cols)), verbose = TRUE]

source: Note that both expressions, although visually appearing to be the same, are not identical.
fr: Notez que les deux expressions, bien qu'elles semblent visuellement identiques, ne le sont pas.

source: For more detailed explanation on that matter, please see the examples in the [`substitute2` documentation](https://rdatatable.gitlab.io/data.table/library/data.table/html/substitute2.html).
fr: Pour une explication plus détaillée à ce sujet, veuillez consulter les exemples dans la [documentation `substitute2`](https://rdatatable.gitlab.io/data.table/library/data.table/html/substitute2.html).

source: Substitution of a complex query
fr: Substitution d'une requête complexe

source: Let's take, as an example of a more complex function, calculating root mean square.
fr: Prenons l'exemple d'une fonction plus complexe, le calcul de la moyenne quadratique.

source: It takes arbitrary number of variables on input, but now we cannot just *splice* a list of arguments into a list call because each of those arguments have to be wrapped in a `square` call. In this case, we have to *splice* by hand rather than relying on data.table's automatic *enlist*.
fr: Il prend un nombre arbitraire de variables en entrée, mais maintenant nous ne pouvons pas simplement ajouter (splice) une liste d'arguments dans un appel de liste parce que chacun de ces arguments doit être enveloppé dans un appel `square`. Dans ce cas, nous devons faire l'opération à la main plutôt que de compter sur la transformation automatique en liste (*'enlist'*) de data.table.

source: First, we have to construct calls to the `square` function for each of the variables (see `inner_calls`). Then, we have to reduce the list of calls into a single call, having a nested sequence of `+` calls (see `add_calls`). Lastly, we have to substitute the constructed call into the surrounding expression (see `rms`).
fr: Tout d'abord, nous devons construire des appels à la fonction `square` pour chacune des variables (voir `inner_calls`). Ensuite, nous devons réduire la liste des appels en un seul appel, avec une séquence imbriquée d'appels `+` (voir `add_calls`). Enfin, nous devons substituer l'appel construit dans l'expression environnante (voir `rms`).

source: #===== r complex outer = "sqrt" inner = "square" vars = c("Sepal.Length", "Sepal.Width", "Petal.Length", "Petal.Width") syms = lapply(vars, as.name) to_inner_call = function(var, fun) call(fun, var) inner_calls = lapply(syms, to_inner_call, inner) print(inner_calls) to_add_call = function(x, y) call("+", x, y) add_calls = Reduce(to_add_call, inner_calls) print(add_calls) rms = substitute2( expr = outer((add_calls) / len), env = list( outer = outer, add_calls = add_calls, len = length(vars) ) ) print(rms) str( DT[, j, env = list(j = rms)] ) # same, but skipping last substitute2 call and using add_calls directly str( DT[, outer((add_calls) / len), env = list( outer = outer, add_calls = add_calls, len = length(vars) )] ) # return as data.table j = substitute2(j, list(j = as.list(setNames(nm = c(vars, "Species", "rms"))))) j[["rms"]] = rms print(j) DT[, j, env = list(j = j)] # alternatively j = as.call(c( quote(list), lapply(setNames(nm = vars), as.name), list(Species = as.name("Species")), list(rms = rms) )) print(j) DT[, j, env = list(j = j)]
fr: #===== r complexe outer = "sqrt" inner = "square" vars = c("Sepal.Length", "Sepal.Width", "Petal.Length", "Petal.Width") syms = lapply(vars, as.name) to_inner_call = function(var, fun) call(fun, var) inner_calls = lapply(syms, to_inner_call, inner) print(inner_calls) to_add_call = function(x, y) call("+", x, y) add_calls = Reduce(to_add_call, inner_calls) print(add_calls) rms = substitute2( expr = outer((add_calls) / len), env = list( outer = outer, add_calls = add_calls, len = length(vars) ) ) print(rms) str( DT[, j, env = list(j = rms)] ) # idem, mais en sautant le dernier appel à substitute2 et en utilisant directement add_calls str( DT[, outer((add_calls) / len), env = list( outer = outer, add_calls = add_calls, len = length(vars) )] ) # retourner le résultat en tant que data.table j = substitute2(j, list(j = as.list(setNames(nm = c(vars, "Species", "rms"))))) j[["rms"]] = rms print(j) DT[, j, env = list(j = j)] # ou alors : j = as.call(c( quote(list), lapply(setNames(nm = vars), as.name), list(Species = as.name("Species")), list(rms = rms) )) print(j) DT[, j, env = list(j = j)]

source: Retired interfaces
fr: Interfaces supprimées

source: In `[.data.table`, it is also possible to use other mechanisms for variable substitution or for passing quoted expressions. These include `get` and `mget` for inline injection of variables by providing their names as strings, and `eval` that tells `[.data.table` that the expression we passed into an argument is a quoted expression and that it should be handled differently. Those interfaces should now be considered retired and we recommend using the new `env` argument, instead.
fr: Dans `[.data.table`, il est aussi possible d'utiliser d'autres mécanismes pour la substitution de variables ou pour passer des expressions entre guillemets. Ceux-ci incluent `get` et `mget` pour l'injection en ligne de variables en fournissant leurs noms sous forme de chaînes, et `eval` qui indique à `[.data.table` que l'expression passée en argument est une expression entre guillemets et qu'elle doit être traitée différemment. Ces interfaces doivent maintenant être considérées comme retirées et nous recommandons d'utiliser le nouvel argument `env` à la place.

source: Instead of using `eval` function we can provide quoted expression into the element of `env` argument, no extra `eval` call is needed then.
fr: Au lieu d'utiliser la fonction `eval`, nous pouvons fournir une expression citée dans l'élément de l'argument `env`, aucun appel supplémentaire à `eval` n'est alors nécessaire.
