Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-intro.Rmd-*.po
Languages: fr

source: =====* Now, we look at `j` and find that it uses only *two columns*. And what we have to do is to compute their `mean()`. Therefore, we subset just those columns corresponding to the matching rows, and compute their `mean()`.=====
fr: =====* Maintenant, nous regardons `j` et nous constatons qu'il n'utilise que *deux colonnes*. Et ce que nous devons faire, c'est calculer leur moyenne avec `mean()`. Par conséquent, nous regroupons uniquement les colonnes d’intérêt aux lignes correspondantes, et nous calculons leurs moyennes.=====

source: =====* **Key-based subsetting: `dt["d"]`**=====
fr: =====* **Sous-ensemble basé sur les clés : `dt["d"]`**=====

source: =====* **Logical subsetting: `dt[x == "d"]`**=====
fr: =====* **Sous-ensemble logique : `dt[x == "d"]`**=====

source: =====* **Exact match using `nomatch=NULL`**=====
fr: =====* **Correspondance exacte en utilisant `nomatch=NULL`**=====

source: =====* Once again, we subset in `i` to get the *row indices* where `origin` airport equals *"JFK"*, and `month` equals *6*.=====
fr: =====* Une fois de plus, nous introduisons `i` pour obtenir les *indices de lignes* pour lesquels l'aéroport `origin` est *"JFK"*, et le `mois` est *6*.=====

source: =====* We see that `j` uses only `.N` and no other columns. Therefore, the entire subset is not materialised. We simply return the number of rows in the subset (which is just the length of row indices).=====
fr: =====* Nous voyons que `j` n'utilise que `.N` et aucune autre colonne. Par conséquent, le sous-ensemble complet n'est pas matérialisé. Nous renvoyons simplement le nombre de lignes dans le sous-ensemble (qui est juste la longueur des indices de ligne).=====

source: =====* Note that we did not wrap `.N` with `list()` or `.()`. Therefore, a vector is returned.=====
fr: =====* Notez que nous n'avons pas enveloppé `.N` avec `list()` ou `.()`. Par conséquent, un vecteur est retourné.=====

source: =====* Using `with()` in (2) allows using `DF`'s column `x` as if it were a variable.=====
fr: =====* L'utilisation de `with()` dans (2) permet d'utiliser la colonne `x` de `DF` comme s'il s'agissait d'une variable.=====

source: =====* We can also *deselect* columns using `-` or `!`. For example:=====
fr: =====* Nous pouvons également *désélectionner* des colonnes en utilisant `-` ou `!`. Par exemple :=====

source: =====* From `v1.9.5+`, we can also select by specifying start and end column names, e.g., `year:day` to select the first three columns.=====
fr: =====* A partir de la `v1.9.5+`, on peut aussi sélectionner en spécifiant les noms des colonnes de début et de fin, par exemple, `year:day` pour sélectionner les trois premières colonnes.=====

source: =====* We know `.N` [is a special variable](#special-N) that holds the number of rows in the current group. Grouping by `origin` obtains the number of rows, `.N`, for each group.=====
fr: =====* Nous savons que `.N` [est une variable spéciale](#special-N) qui contient le nombre de lignes dans le groupe courant. En groupant par `origine`, on obtient le nombre de lignes, `.N`, pour chaque groupe.=====

source: =====* By doing `head(flights)` you can see that the origin airports occur in the order *"JFK"*, *"LGA"*, and *"EWR"*. The original order of grouping variables is preserved in the result. *This is important to keep in mind!*=====
fr: =====* En faisant `head(flights)` vous pouvez voir que les aéroports d'origine sont dans l'ordre *"JFK"*, *"LGA"*, et *"EWR"*. L'ordre original de regroupement des variables est préservé dans le résultat. *Il est important de garder cela à l'esprit!*=====

source: =====* Since we did not provide a name for the column returned in `j`, it was named `N` automatically by recognising the special symbol `.N`.=====
fr: =====* Comme nous n'avons pas fourni de nom pour la colonne retournée dans `j`, elle a été nommée `N` automatiquement en reconnaissant le symbole spécial `.N`.=====

source: =====* `by` also accepts a character vector of column names. This is particularly useful for coding programmatically, e.g., designing a function with the grouping columns (in the form of a `character` vector) as a function argument.=====
fr: =====* `by` accepte également un vecteur de caractères de noms de colonnes. Ceci est particulièrement utile pour le codage par programmation, par exemple pour concevoir une fonction avec les colonnes de regroupement (sous la forme d'un vecteur `character`) comme argument de la fonction.=====

source: =====* When there's only one column or expression to refer to in `j` and `by`, we can drop the `.()` notation. This is purely for convenience. We could instead do:=====
fr: =====* Lorsqu'il n'y a qu'une seule colonne ou expression à laquelle se référer dans `j` et `by`, nous pouvons abandonner la notation `.()`. Ceci est purement pratique. Nous pourrions plutôt faire :=====

source: =====* We first obtain the row indices for the expression `carrier == "AA"` from `i`.=====
fr: =====* Nous obtenons d'abord les indices de ligne pour l'expression `carrier == "AA"` à partir de `i`.=====

source: =====* Using those *row indices*, we obtain the number of rows while grouped by `origin`. Once again no columns are actually materialised here, because the `j-expression` does not require any columns to be actually subsetted and is therefore fast and memory efficient.=====
fr: =====* En utilisant ces *index de ligne*, nous obtenons le nombre de lignes groupées par `origine`. Une fois de plus, aucune colonne n'est matérialisée ici, car l'expression `j` ne nécessite aucune colonne pour définir le sous-ensemble et le calcul est donc rapide et peu gourmand en mémoire.=====

source: =====* `by` accepts multiple columns. We just provide all the columns by which to group by. Note the use of `.()` again in `by` -- again, this is just shorthand for `list()`, and `list()` can be used here as well. Again, we'll stick with `.()` in this vignette.=====
fr: =====* `by` accepte plusieurs colonnes. Nous fournissons simplement toutes les colonnes par lesquelles il faut grouper. Notez l'utilisation de `.()` dans `by` -- encore une fois, c'est juste un raccourci pour `list()`, et `list()` peut être utilisé ici aussi. Nous nous en tiendrons à nouveau à `.()` dans cette vignette.=====

source: =====* Since we did not provide column names for the expressions in `j`, they were automatically generated as `V1` and `V2`.=====
fr: =====* Comme nous n'avons pas fourni de noms de colonnes pour les expressions dans `j`, elles ont été automatiquement générées en tant que `V1` et `V2`.=====

source: =====* Once again, note that the input order of grouping columns is preserved in the result.=====
fr: =====* Une fois de plus, notez que l'ordre d'entrée des colonnes de regroupement est préservé dans le résultat.=====

source: =====* All we did was change `by` to `keyby`. This automatically orders the result by the grouping variables in increasing order. In fact, due to the internal implementation of `by` first requiring a sort before recovering the original table's order, `keyby` is typically faster than `by` because it doesn't require this second step.=====
fr: =====* Tout ce que nous avons fait, c'est remplacer `by` par `keyby`. Cela ordonne automatiquement le résultat par ordre croissant des variables de regroupement. En fait, à cause de l'implémentation interne de `by` qui nécessite d'abord un tri avant de récupérer l'ordre de la table originale, `keyby` est typiquement plus rapide que `by` parce qu'il ne nécessite pas cette seconde étape.=====

source: =====* Recall that we can use `-` on a `character` column in `order()` within the frame of a `data.table`. This is possible due to `data.table`'s internal query optimisation.=====
fr: =====* Rappelons que nous pouvons utiliser `-` sur une colonne `character` dans `order()` dans le cadre d'un `data.table`. Ceci est possible grâce à l'optimisation interne des requêtes de `data.table`.=====

source: =====* Also recall that `order(...)` with the frame of a `data.table` is *automatically optimised* to use `data.table`'s internal fast radix order `forder()` for speed. =====
fr: =====* Rappelez-vous aussi que `order(...)` dans le contexte d'un `data.table` est *automatiquement optimisé* pour utiliser l’algorithme de tri radix rapide interne de `data.table` `forder()` pour plus de rapidité. =====

source: =====* We can tack expressions one after another, *forming a chain* of operations, i.e., `DT[ ... ][ ... ][ ... ]`.=====
fr: =====* Nous pouvons ajouter des expressions l'une après l'autre, *formant une chaîne* d'opérations, c'est-à-dire `DT[ ... ][ ... ][ ... ]`.=====

source: =====* Or you can also chain them vertically:=====
fr: =====* Vous pouvez également les enchaîner verticalement :=====

source: =====* The last row corresponds to `dep_delay > 0 = TRUE` and `arr_delay > 0 = FALSE`. We can see that `r flights[!is.na(arr_delay) & !is.na(dep_delay), .N, .(dep_delay>0, arr_delay>0)][, N[4L]]` flights started late but arrived early (or on time).=====
fr: =====* La dernière ligne correspond à `dep_delay > 0 = TRUE` et `arr_delay > 0 = FALSE`. Nous pouvons voir que les vols `r flights[!is.na(arr_delay) & !is.na(dep_delay), .N, .(dep_delay>0, arr_delay>0)][, N[4L]]` ont commencé en retard mais sont arrivés en avance (ou à l'heure).=====

source: =====* Note that we did not provide any names to `by-expression`. Therefore, names have been automatically assigned in the result. As with `j`, you can name these expressions as you would for elements of any `list`, like for e.g. `DT[, .N, .(dep_delayed = dep_delay>0, arr_delayed = arr_delay>0)]`.=====
fr: =====* Notez que nous n'avons pas fourni de noms à `by-expression`. Par conséquent, les noms ont été automatiquement assignés dans le résultat. Comme pour `j`, vous pouvez nommer ces expressions comme vous le feriez pour des éléments de n'importe quelle liste, comme par exemple `DT[, .N, .(dep_delayed = dep_delay>0, arr_delayed = arr_delay>0)]`.=====

source: =====* You can provide other columns along with expressions, for example: `DT[, .N, by = .(a, b>0)]`.=====
fr: =====* Vous pouvez fournir d'autres colonnes avec des expressions, par exemple : `DT[, .N, by = .(a, b>0)]`.=====

source: =====* `.SD` contains all the columns *except the grouping columns* by default.=====
fr: =====* `.SD` contient toutes les colonnes *à l'exception des colonnes de regroupement* par défaut.=====

source: =====* It is also generated by preserving the original order - data corresponding to `ID = "b"`, then `ID = "a"`, and then `ID = "c"`.=====
fr: =====* Il est également généré en conservant l'ordre original - les données correspondant à `ID = "b"`, puis `ID = "a"`, et enfin `ID = "c"`.=====

source: =====* `.SD` holds the rows corresponding to columns `a`, `b` and `c` for that group. We compute the `mean()` on each of these columns using the already-familiar base function `lapply()`.=====
fr: =====* `.SD` contient les lignes correspondant aux colonnes `a`, `b` et `c` pour ce groupe. Nous calculons la moyenne avec `mean()` sur chacune de ces colonnes en utilisant la fonction de base déjà familière `lapply()`.=====

source: =====* Each group returns a list of three elements containing the mean value which will become the columns of the resulting `data.table`.=====
fr: =====* Chaque groupe renvoie une liste de trois éléments contenant la valeur moyenne qui deviendra les colonnes du `data.table` résultant.=====

source: =====* Since `lapply()` returns a `list`, so there is no need to wrap it with an additional `.()` (if necessary, refer to [this tip](#tip-1)).=====
fr: =====* Puisque `lapply()` renvoie une liste, il n'est pas nécessaire de l'entourer d'un `.()` supplémentaire (si nécessaire, référez-vous à [cette astuce](#tip-1)).=====

source: =====* `.SD` is a `data.table` that holds all the rows for *that group*. We simply subset the first two rows as we have seen [here](#subset-rows-integer) already.=====
fr: =====* `.SD` est un `data.table` qui contient toutes les lignes de *ce groupe*. Nous allons simplement subdiviser les deux premières lignes comme nous l'avons déjà vu [ici](#subset-rows-integer).=====

source: =====* For each group, `head(.SD, 2)` returns the first two rows as a `data.table`, which is also a `list`, so we do not have to wrap it with `.()`.=====
fr: =====* Pour chaque groupe, `head(.SD, 2)` renvoie les deux premières lignes sous forme de `data.table`, qui est également une liste, ce qui nous évite de l'entourer de `.()`.=====

source: =====* That's it. There is no special syntax required. All we need to know is the base function `c()` which concatenates vectors and [the tip from before](#tip-1).=====
fr: =====* C'est tout. Aucune syntaxe particulière n'est requise. Tout ce que nous avons besoin de connaître est la fonction de base `c()` qui concatène des vecteurs, ainsi que [l'astuce de tout à l'heure](#tip-1).=====

source: =====* Here, we first concatenate the values with `c(a,b)` for each group, and wrap that with `list()`. So for each group, we return a list of all concatenated values.=====
fr: =====* Ici, nous concaténons d'abord les valeurs avec `c(a,b)` pour chaque groupe, et nous les enveloppons avec `list()`. Ainsi, pour chaque groupe, nous renvoyons une liste de toutes les valeurs concaténées.=====

source: =====* Note that those commas are for display only. A list column can contain any object in each cell, and in this example, each cell is itself a vector and some cells contain longer vectors than others.=====
fr: =====* Notez que ces virgules ne servent qu'à l'affichage. Une colonne de liste peut contenir n'importe quel objet dans chaque cellule et, dans cet exemple, chaque cellule est elle-même un vecteur et certaines cellules contiennent des vecteurs plus longs que d'autres.=====

source: =====* We can also sort a `data.table` using `order()`, which internally uses data.table's fast order for better performance.=====
fr: =====* Nous pouvons également trier un `data.table` en utilisant `order()`, qui utilise en interne l’algorithme de tri rapide de data.table pour de meilleures performances.=====

source: =====1. Select columns the `data.table` way: `DT[, .(colA, colB)]`.=====
fr: =====1. Sélectionner les colonnes à la manière de `data.table` : `DT[, .(colA, colB)]`.=====

source: =====2. Select columns the `data.frame` way: `DT[, c("colA", "colB")]`.=====
fr: =====2. Sélectionner les colonnes à la manière de `data.frame` : `DT[, c("colA", "colB")]`.=====

source: =====3. Compute on columns: `DT[, .(sum(colA), mean(colB))]`.=====
fr: =====3. Effectuer des calculs sur les colonnes : `DT[, .(sum(colA), mean(colB))]`.=====

source: =====4. Provide names if necessary: `DT[, .(sA =sum(colA), mB = mean(colB))]`.=====
fr: =====4. Indiquer les noms si nécessaire : `DT[, .(sA =sum(colA), mB = mean(colB))]`.=====

source: =====5. Combine with `i`: `DT[colA > value, sum(colB)]`.=====
fr: =====5. Combiner avec `i` : `DT[colA > valeur, sum(colB)]`.=====

source: =====* Using `by`, we can group by columns by specifying a *list of columns* or a *character vector of column names* or even *expressions*. The flexibility of `j`, combined with `by` and `i`, makes for a very powerful syntax.=====
fr: =====* En utilisant `by`, nous pouvons grouper par colonnes en spécifiant une *liste de colonnes* ou un *vecteur de caractères de noms de colonnes* ou même des *expressions*. La flexibilité de `j`, combinée à `by` et `i`, en fait une syntaxe très puissante.=====

source: =====* `by` can handle multiple columns and also *expressions*.=====
fr: =====* `by` peut gérer plusieurs colonnes ainsi que des *expressions*.=====

source: =====* We can `keyby` grouping columns to automatically sort the grouped result.=====
fr: =====* Nous pouvons regrouper les colonnes par `keyby` pour trier automatiquement les résultats groupés.=====

source: =====* We can use `.SD` and `.SDcols` in `j` to operate on multiple columns using already familiar base functions. Here are some examples:=====
fr: =====* Nous pouvons utiliser `.SD` et `.SDcols` dans `j` pour opérer sur plusieurs colonnes en utilisant des fonctions de base déjà connues. Voici quelques exemples:=====

source: =====_1. `DT[, lapply(.SD, fun), by = ..., .SDcols = ...]` - applies `fun` to all columns specified in `.SDcols` while grouping by the columns specified in `by`.=====
fr: =====_1. `DT[, lapply(.SD, fun), by = ..., .SDcols = ...]` - applique `fun` à toutes les colonnes spécifiées dans `.SDcols` tout en groupant par les colonnes spécifiées dans `by`.=====

source: =====_2. `DT[, head(.SD, 2), by = ...]` - return the first two rows for each group.=====
fr: =====_2. `DT[, head(.SD, 2), by = ...]` - renvoie les deux premières lignes pour chaque groupe.=====

source: =====_3. `DT[col > val, head(.SD, 1), by = ...]` - combine `i` along with `j` and `by`.=====
fr: =====_3. `DT[col > val, head(.SD, 1), by = ...]` - combine `i` avec `j` et `by`.=====

source: =====* Within the frame of a `data.table`, columns can be referred to *as if they are variables*, much like in SQL or Stata. Therefore, we simply refer to `origin` and `month` as if they are variables. We do not need to add the prefix `flights$$$` each time. Nevertheless, using `flights$$$origin` and `flights$$$month` would work just fine.=====
fr: =====* Dans le cadre d'un `data.table`, on peut se référer aux colonnes *comme s'il s'agissait de variables*, un peu comme dans SQL ou Stata. Par conséquent, nous nous référons simplement à `origin` et `month` comme s'il s'agissait de variables. Nous n'avons pas besoin d'ajouter le préfixe `vol$$$` à chaque fois. Néanmoins, l'utilisation de `flights$$$origin` et `flights$$$month` fonctionnerait parfaitement.=====

source: =====* We can subset rows similar to a `data.frame`- except you don't have to use `DT$$$` repetitively since columns within the frame of a `data.table` are seen as if they are *variables*.=====
fr: =====* Nous pouvons subdiviser les lignes comme dans un `data.frame` - sauf que vous n'avez pas besoin d'utiliser `DT$$$` de façon répétitive puisque les colonnes dans le contexte d'un `data.table` sont vues comme si elles étaient des *variables*.=====
