Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-intro.Rmd-*.po
Languages: fr

source: This vignette introduces the `data.table` syntax, its general form, how to *subset* rows, *select and compute* on columns, and perform aggregations *by group*. Familiarity with the `data.frame` data structure from base R is useful, but not essential to follow this vignette.
fr: Cette vignette présente la syntaxe de `data.table` , sa forme générale, comment *extraire les lignes*, *sélectionner et faire des opérations* sur les colonnes, et réaliser des agrégations *par groupe*. Il est avantageux d'être familiarisé avec la structure de données `data.frame` de base du R, mais cela n'est pas essentiel pour suivre cette vignette.

source: Data analysis using `data.table`
fr: Analyser des données en utilisant `data.table`

source: Data manipulation operations such as *subset*, *group*, *update*, *join*, etc. are all inherently related. Keeping these *related operations together* allows for:
fr: Les opérations concernant le traitement des données telles que *subset*, *group*, *update*, *join*, etc. sont toutes intimement liées. En regroupant *ces opérations apparentées* cela nous permet :

source: Briefly, if you are interested in reducing *programming* and *compute* time tremendously, then this package is for you. The philosophy that `data.table` adheres to makes this possible. Our goal is to illustrate it through this series of vignettes.
fr: En résumé, si vous souhaitez réduire drastiquement le temps de *programmation* et de *compilation*, alors ce package est fait pour vous. C'est la philosophie suivie par `data.table` pour rendre cela possible. Notre but est d'illustrer ceci au travers de cette série de vignettes.

source: Data {#data}
fr: Données {#data}

source: In this vignette, we will use [NYC-flights14](https://raw.githubusercontent.com/Rdatatable/data.table/master/vignettes/flights14.csv) data obtained from the [flights](https://github.com/arunsrinivasan/flights) package (available on GitHub only). It contains On-Time flights data from the Bureau of Transportation Statistics for all the flights that departed from New York City airports in 2014 (inspired by [nycflights13](https://github.com/tidyverse/nycflights13)). The data is available only for Jan-Oct'14.
fr: Dans cette vignette, nous utiliseront les données [NYC-flights14](https://raw.githubusercontent.com/Rdatatable/data.table/master/vignettes/flights14.csv) obtenues du package [flights](https://github.com/arunsrinivasan/flights) (disponible sur GitHub seulement). Il contient les horaires des vols d'avions du Bureau of Transportation Statistics à propos de tous les vols partant des aéroports de New York City en 2014 (inspiré de [nycflights13](https://github.com/tidyverse/nycflights13)). Les données ne concernent que les mois de janvier à octobre 2014.

source: We can use `data.table`'s fast-and-friendly file reader `fread` to load `flights` directly as follows:
fr: Vous pouvez utiliser le lecteur de fichiers rapide et convivial `fread` de `data.table` pour charger `flights` ditectement ainsi :

source: Aside: `fread` accepts `http` and `https` URLs directly, as well as operating system commands such as `sed` and `awk` output. See `?fread` for examples.
fr: A noter : `fread` accepte directement les URLS `http` et `https`, ainsi que les commandes système opérationnelles telles que les sorties de `sed` et `awk`. Voir `?fread` pour les exemples.

source: In this vignette, we will
fr: Dans cette vignette, nous allons

source: 1. Basics {#basics-1}
fr: 1. Les bases {#basics-1}

source: a) What is `data.table`? {#what-is-datatable-1a}
fr: a) `data.table` c'est quoi ? {#what-is-datatable-1a}

source: `data.table` is an R package that provides **an enhanced version** of a `data.frame`, the standard data structure for storing data in `base` R. In the [Data](#data) section above, we saw how to create a `data.table` using `fread()`, but alternatively we can also create one using the `data.table()` function. Here is an example:
fr: `data.table` est un package R qui fournit **une version étendue** d'un `data.frame`, qui est la structure de données standard pour stocker des données dans la `base` R. Dans la [Data](#data) section ci-dessus, nous avons vu comment créer une `data.table` avec `fread()`, mais on peut aussi en créer une en utilisant la fonction `data.table()` . Voici un exemple :

source: You can also convert existing objects to a `data.table` using `setDT()` (for `data.frame` and `list` structures) or `as.data.table()` (for other structures). For more details pertaining to the difference (goes beyond the scope of this vignette), please see `?setDT` and `?as.data.table`.
fr: Vous pouvez aussi convertir des objets existants en une `data.table` en utilisant `setDT()` (pour les structures `data.frame` et `list`) ou `as.data.table()` (pour les autres structures). Pour les autres détails concernant les différences (ce qui est hors du champ de cette vignette), voir `?setDT` et `?as.data.table`.

source: Note that:
fr: Notez que :

source: b) General form - in what way is a `data.table` *enhanced*? {#enhanced-1b}
fr: b) Forme générale - dans quel sens la `data.table` est-elle *étendue* ? {#enhanced-1b}

source: In contrast to a `data.frame`, you can do *a lot more* than just subsetting rows and selecting columns within the frame of a `data.table`, i.e., within `[ ... ]` (NB: we might also refer to writing things inside `DT[...]` as "querying `DT`", as an analogy or in relevance to SQL). To understand it we will have to first look at the *general form* of the `data.table` syntax, as shown below:
fr: Par rapport à un `data.frame`, vous pouvez faire *beaucoup plus de choses* qu'extraire des lignes et sélectionner des colonnes dans la structure d'une `data.table`, par exemple, avec `[ ... ]` (Notez bien : nous pourrions aussi faire référence à écrire quelque chose dans `DT[...]` comme "interroger `DT`", par analogie ou similairement à SQL). Pour le comprendre il faut d'abord que nous regardions la *forme générale* de la syntaxe `data.table`, comme indiqué ci-dessous :

source: Users with an SQL background might perhaps immediately relate to this syntax.
fr: Les utilisateurs ayant des connaissances SQL feront peut être directement le lien avec cette syntaxe.

source: The way to read it (out loud) is:
fr: La manière de le lire (à haute voix) est :

source: Take `DT`, subset/reorder rows using `i`, then calculate `j`, grouped by `by`.
fr: Utiliser `DT`, extraire ou trier les lignes en utilisant `i`, puis calculer `j`, grouper avec `by`.

source: Let's begin by looking at `i` and `j` first - subsetting rows and operating on columns.
fr: Commençons par voir `i` et `j` d'abord - en indiçant les lignes et en travaillant sur les colonnes.

source: c) Subset rows in `i` {#subset-i-1c}
fr: c) Regrouper les lignes en `i` {#subset-i-1c}

source: -- Get all the flights with "JFK" as the origin airport in the month of June.
fr: -- Obtenir tous les vols qui ont "JFK" comme aéroport de départ pendant le mois de juin.

source: -- Get the first two rows from `flights`. {#subset-rows-integer}
fr: -- Récupérer les deux premières lignes de `flights`. {#subset-rows-integer}

source: -- Sort `flights` first by column `origin` in *ascending* order, and then by `dest` in *descending* order:
fr: -- Trier `flights` d'abord sur la colonne `origin` dans l'ordre *ascending*, puis par `dest` dans l'ordre *descendant* :

source: We can use the R function `order()` to accomplish this.
fr: Nous pouvons utiliser la fonction R `order()` pour faire cela.

source: `order()` is internally optimised
fr: `order()` est optimisé en interne

source: We will discuss `data.table`'s fast order in more detail in the *`data.table` internals* vignette.
fr: Nous discuterons de l'ordonnancement rapide de la `data.table` plus en détails dans la vignette *fonctionnement interne de `data.table` internals*.

source: d) Select column(s) in `j` {#select-j-1d}
fr: d) Sélection de colonne(s) dans `j` {#select-j-1d}

source: -- Select `arr_delay` column, but return it as a *vector*.
fr: -- Sélectionner la colonne `arr_delay`, mais la renvoyer en tant que *vector*.

source: -- Select `arr_delay` column, but return as a `data.table` instead.
fr: -- Sélectionner la colonne `arr_delay`, mais la renvoyer en tant que `data.table`.

source: A `data.table` (and a `data.frame` too) is internally a `list` as well, with the stipulation that each element has the same length and the `list` has a `class` attribute. Allowing `j` to return a `list` enables converting and returning `data.table` very efficiently.
fr: Un `data.table` (et également un `data.frame`) est aussi en interne une `list` , avec la caractéristique que chaque élément a la même longueur et que la `list` possède un attribut `class`. En permettant à `j` de renvoyer une `list` cela permet de convertir et de renvoyer des `data.table` très efficacement.

source: Tip: {#tip-1}
fr: Conseil : {#tip-1}

source: As long as `j-expression` returns a `list`, each element of the list will be converted to a column in the resulting `data.table`. This makes `j` quite powerful, as we will see shortly. It is also very important to understand this for when you'd like to make more complicated queries!!
fr: Tant que `j-expression` renvoie une `list`, chaque élément de la liste sera converti en colonne dans la `data.table` résultante. Ce qui fait que `j` est très puissant, comme nous le verrons bientôt. Il est aussi très important de comprendre cela dans le cas où vous auriez à faire des requêtes plus compliquées !!

source: -- Select both `arr_delay` and `dep_delay` columns.
fr: -- Sélectionner à la fois les colonnes `arr_delay` et `dep_delay`.

source: -- Select both `arr_delay` and `dep_delay` columns *and* rename them to `delay_arr` and `delay_dep`.
fr: -- Sélectionner à la fois les colonnes `arr_delay` et `dep_delay` *et* les renommer en `delay_arr` et `delay_dep`.

source: Since `.()` is just an alias for `list()`, we can name columns as we would while creating a `list`.
fr: Comme `.()` est juste un alias pour `list()`, nous pouvons donner un nom quelconque aux colonnes comme si on créait une `list`.

source: e) Compute or *do* in `j`
fr: e) Calcul ou *do* dans `j`

source: -- How many trips have had total delay < 0?
fr: -- Combien de voyages on eu un retard total < 0 ?

source: What's happening here?
fr: Que se passe-t-il dans ce cas ?

source: f) Subset in `i` *and* do in `j`
fr: f) Sous-ensemble de `i` *et* do dans `j`

source: -- Calculate the average arrival and departure delay for all flights with "JFK" as the origin airport in the month of June.
fr: -- Calculer le nombre moyen de retards des arrivées et des départs pour tous les vols au départ de l'aéroport "JFK" pendant le mois de juin.

source: Because the three main components of the query (`i`, `j` and `by`) are *together* inside `[...]`, `data.table` can see all three and optimise the query altogether *before evaluation*, rather than optimizing each separately. We are able to therefore avoid the entire subset (i.e., subsetting the columns *besides* `arr_delay` and `dep_delay`), for both speed and memory efficiency.
fr: Parce que les trois composants principaux de la requête (`i`, `j` et `by`) figurent *ensemble* dans `[...]`, `data.table` peut les voir tous trois et optimiser la requête dans sa totalité *avant l'évaluation*, plutôt que d'optimiser chacun séparément. Par conséquent nous pouvons éviter le sous-ensemble complet (par exemple trier les colonnes *annexes* `arr_delay` et `dep_delay`), pour la rapidité et l'efficacité de la mémoire.

source: -- How many trips have been made in 2014 from "JFK" airport in the month of June?
fr: -- Combien de voyages ont été réalisés en 2014 au départ de l'aéroport "JFK" au mois de juin ?

source: The function `length()` requires an input argument. We just need to compute the number of rows in the subset. We could have used any other column as the input argument to `length()`. This approach is reminiscent of `SELECT COUNT(dest) FROM flights WHERE origin = 'JFK' AND month = 6` in SQL.
fr: La fonction `length()` nécessite un argument d'entrée. Il suffit juste de calculer le nombre de lignes du sous-ensemble. On aurait pu utiliser n'importe quelle colonne comme argument d'entrée de `length()`. Cette approche est une réminiscence de `SELECT COUNT(dest) FROM flights WHERE origin = 'JFK' AND month = 6` en SQL.

source: This type of operation occurs quite frequently, especially while grouping (as we will see in the next section), to the point where `data.table` provides a *special symbol* `.N` for it.
fr: Ce type d'opération arrive assez fréquement, particulièrement lors des regroupements (comme nous le verrons dans la section suivante), au point que `data.table` fournit un *symbole spécial* `.N` pour cela.

source: g) Handle non-existing elements in `i`
fr: g) Gérer les éléments absents dans `i`

source: -- What happens when querying for non-existing elements?
fr: -- Que se passe-t-il quand on interroge des éléments non-existants ?

source: When querying a `data.table` for elements that do not exist, the behavior differs based on the method used.
fr: Lorsque vous interrogez une `data.table` pour des éléments qui n'existent pas, le comportement dépend de la méthode utilisée.

source: This performs a right join on the key column `x`, resulting in a row with `d` and `NA` for columns not found. When using `setkeyv`, the table is sorted by the specified keys and an internal index is created, enabling binary search for efficient subsetting.
fr: Ceci réalise une jointure parfaite sur la colonne clé `x`, fournissant une rangée avec `d` et `NA` pour les colonnes absentes. En utilisant `setkeyv`, la table est triée en fonction des clés fournies et un index interne est créé, permettant une recherche binaire et des performances optimisées.

source: This performs a standard subset operation that does not find any matching rows and thus returns an empty `data.table`.
fr: Ceci réalise une opération standard de sous-ensemble qui ne trouve aucune correspondance de lignes et donc renvoie une `data.table` vide.

source: For exact matches without `NA` for non-existing elements, use `nomatch=NULL`:
fr: Pour une correspondance stricte sans `NA` pour les éléments absents, utiliser `nomatch=NULL` :

source: Understanding these behaviors can help prevent confusion when dealing with non-existing elements in your data.
fr: En assimilant ces comportements, cela vous ôtera toute confusion lorsque vous trouverez des éléments absents parmi vos données.

source: Special symbol `.N`: {#special-N}
fr: Symbol spécial `.N`: {#special-N}

source: `.N` is a special built-in variable that holds the number of observations *in the current group*. It is particularly useful when combined with `by` as we'll see in the next section. In the absence of group by operations, it simply returns the number of rows in the subset.
fr: `.N` est une variable interne spéciale qui contient le nombre d'observations *dans le groupe actuel*. Elle est particulièrement utile combinée avec `by` comme nous le verrons dans la prochaine section. S'il n'y a pas de groupe pour les opérations, le nombre de lignes dans le sous-ensemble sera simplement renvoyé.

source: Now that we now, we can now accomplish the same task by using `.N` as follows:
fr: Maintenant que nous savons, nous pouvons accomplir la même tâche en utilisant `.N` ainsi :

source: We could have accomplished the same operation by doing `nrow(flights[origin == "JFK" & month == 6L])`. However, it would have to subset the entire `data.table` first corresponding to the *row indices* in `i` *and then* return the rows using `nrow()`, which is unnecessary and inefficient. We will cover this and other optimisation aspects in detail under the *`data.table` design* vignette.
fr: On aurait pu faire la même opération en écrivant `nrow(flights[origin == "JFK" & month == 6L])`. Néanmoins il aurait fallu d'abord dissocier la `data.table` entière en fonction des *indices de lignes* dans `i` *puis* renvoyer les lignes en utilisant `nrow()`, ce qui est inutile et pas efficace. Nous aborderons en détails ce sujet et d'autres aspects de l'optimisation dans la vignette *architecture de `data.table`*.

source: h) Great! But how can I refer to columns by names in `j` (like in a `data.frame`)? {#refer_j}
fr: h) Super ! Mais comment référencer les colonnes par nom dans `j` (comme avec un `data.frame`) ? {#refer_j}

source: If you're writing out the column names explicitly, there's no difference compared to a `data.frame` (since v1.9.8).
fr: Si vous imprimez le nom des colonnes explicitement, il n'y a pas de différence avec un `data.frame` (depuis v1.9.8).

source: -- Select both `arr_delay` and `dep_delay` columns the `data.frame` way.
fr: -- Sélectionner simultanément les colonnes `arr_delay` et `dep_delay` à la manière d'un `data.frame`.

source: If you've stored the desired columns in a character vector, there are two options: Using the `..` prefix, or using the `with` argument.
fr: Si vous avez stocké les colonnes souhaitées dans un vecteur de caractères, il y a deux options : utiliser le préfixe `..` , ou utiliser l'argument `with`.

source: -- Select columns named in a variable using the `..` prefix
fr: -- Sélectionnez les colonnes nommées dans une variable en utilisant le préfixe `..`

source: For those familiar with the Unix terminal, the `..` prefix should be reminiscent of the "up-one-level" command, which is analogous to what's happening here -- the `..` signals to `data.table` to look for the `select_cols` variable "up-one-level", i.e., within the global environment in this case.
fr: Pour les habitués du terminal Unix, le préfixe `..` devrait rappeler la commande de "remontée d'un niveau", qui est analogue à ce qui se passe ici -- le `..` demande à `data.table` de chercher la variable `select_cols` "un nivau au-dessus", c'est à dire dans ce cas, dans l'envronnement global.

source: -- Select columns named in a variable using `with = FALSE`
fr: -- Sélectionner les colonnes nommées dans une variable en utilisant `with = FALSE`

source: The argument is named `with` after the R function `with()` because of similar functionality. Suppose you have a `data.frame` `DF` and you'd like to subset all rows where `x > 1`. In `base` R you can do the following:
fr: L'argument s'appelle `with` d'après la fonction R `with()` à cause de la fonctionnalité similaire. Supposez que vous ayiez une `data.frame` `DF` et que vous vouliez dissocier toutes les lignes où `x > 1`. Dans la `base` R vous pouvez écrire :

source: `with = TRUE` is the default in `data.table` because we can do much more by allowing `j` to handle expressions - especially when combined with `by`, as we'll see in a moment.
fr: `with = TRUE` est la valeur par défaut dans `data.table` car nous pouvons faire plus en permettant à `j` de gérer des expressions - particulièrement en combinant avec `by`, comme nous le verrons dans un instant.

source: 2. Aggregations
fr: 2. Aggrégations

source: We've already seen `i` and `j` from `data.table`'s general form in the previous section. In this section, we'll see how they can be combined together with `by` to perform operations *by group*. Let's look at some examples.
fr: Nous avons déjà vu `i` et `j` dans la forme générale d'une `data.table` dans la secton précédente. Dans cette section, nous allons voir comment ils peuvent être combinés ensemble avec `by` pour réaliser des opérations *par groupe*. Voyons quelques exemples.

source: a) Grouping using `by`
fr: a) Regrouper avec `by`

source: -- How can we get the number of trips corresponding to each origin airport?
fr: -- Comment obtenir le nombre de voyages au départ de chaque aéroport ?

source: -- How can we calculate the number of trips for each origin airport for carrier code `"AA"`? {#origin-.N}
fr: -- Comment calculer le nombre de voyages au départ de chaque aéroport pour le transporteur ayant le code `"AA"`? {#origin-.N}

source: The unique carrier code `"AA"` corresponds to *American Airlines Inc.*
fr: Le code unique de transporteur `"AA"` correspond à *American Airlines Inc.*

source: -- How can we get the total number of trips for each `origin, dest` pair for carrier code `"AA"`? {#origin-dest-.N}
fr: -- Comment obtenir le nombre total de voyages pour chaque paire `origin, dest` du transporteur ayant pour code `"AA"`? {#origin-dest-.N}

source: -- How can we get the average arrival and departure delay for each `orig,dest` pair for each month for carrier code `"AA"`? {#origin-dest-month}
fr: -- Comment obtenir les valeurs moyennes menselles du retard des arrivées et des départs pour chaque paire `orig,dest` pour le transporteur ayant le code `"AA"`? {#origin-dest-month}

source: Now what if we would like to order the result by those grouping columns `origin`, `dest` and `month`?
fr: Maintenant qu'adviendrait-il si nous voulions trier les résultats en groupant les colonnes `origin`, `dest` et `month` ?

source: b) Sorted `by`: `keyby`
fr: b) Tri `by` : `keyby`

source: `data.table` retaining the original order of groups is intentional and by design. There are cases when preserving the original order is essential. But at times we would like to automatically sort by the variables in our grouping.
fr: `data.table` conserve l'ordre original des groupes; c'est intentionnel et défini à la conception. Il existe des cas où conserver l'ordre original est essentiel. Mais à certains moments, nous aimerions trier automatiquement par variables dans notre regroupement.

source: -- So how can we directly order by all the grouping variables?
fr: -- Donc comment pourrions-nous trier directement sur toutes les variables de regroupement ?

source: **Keys:** Actually `keyby` does a little more than *just ordering*. It also *sets a key* after ordering by setting an `attribute` called `sorted`.
fr: **Clés :** actuellement `keyby` en fait un peu plus que *simplement trier*. Il *définit une clé* également après le tri en initialisant un `attribute` appelé `sorted`.

source: We'll learn more about `keys` in the *Keys and fast binary search based subset* vignette; for now, all you have to know is that you can use `keyby` to automatically order the result by the columns specified in `by`.
fr: Nous en apprendrons plus au sujet des `clés` dans la vignette *Clés et sous-ensembles basés sur la recherche binaire rapide*; pour l'instant, tout ce que vous devez savoir est que vous pouvez utiliser `keyby` pour trier automatiquement le résultat selon les colonnes spécifiées dans `by`.

source: c) Chaining
fr: c) Chaînage

source: Let's reconsider the task of [getting the total number of trips for each `origin, dest` pair for carrier *"AA"*](#origin-dest-.N).
fr: Considérons la tâche consistant à [récupérer le nombre total de voyages pour chaque couple `origin, dest` du transporteur *"AA"*](#origin-dest-.N).

source: -- How can we order `ans` using the columns `origin` in ascending order, and `dest` in descending order?
fr: -- Comment trier `ans` en utilisant la colonne `origin` en mode croissant, et la colonne `dest` en mode décroissant ?

source: We can store the intermediate result in a variable, and then use `order(origin, -dest)` on that variable. It seems fairly straightforward.
fr: On peut stocker le résultat intermédiaire dans une variable, puis passer `order(origin, -dest)` sur cette variable. Cela semble plus direct.

source: But this requires having to assign the intermediate result and then overwriting that result. We can do one better and avoid this intermediate assignment to a temporary variable altogether by *chaining* expressions.
fr: Mais ceci nécessite d'avoir assigné le résultat intermédiaire et de réécrire ce résultat. On peut faire mieux et éviter cette assignation intermédiaire à une variable temporaire en *chaînant* les expressions ensemble.
