Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-reshape.Rmd-*.po
Languages: fr

source: If we use the current functionality of `dcast`, then we'd have to cast twice and bind the results together. But that's once again verbose, not straightforward and is also inefficient.
fr: Si nous utilisons la fonctionnalité actuelle de `dcast`, nous devrions effectuer la transformation via `cast` deux fois et combiner les résultats. Mais c'est une fois de plus verbeux, compliqué et inefficace.

source: - Casting multiple `value.var`s simultaneously
fr: - Transformation (`cast`) de plusieurs `value.var`s simultanément

source: We can now provide **multiple `value.var` columns** to `dcast` for `data.table`s directly so that the operations are taken care of internally and efficiently.
fr: Nous pouvons désormais fournir **plusieurs colonnes `value.var`** à `dcast` pour les objets `data.table` directement, de sorte que les opérations soient gérées en interne de manière efficace.

source: ## new 'cast' functionality - multiple value.vars DT.c2 = dcast(DT.m2, family_id + age_mother ~ variable, value.var = c("dob", "gender")) DT.c2
fr: ## nouvelle fonctionnalité 'cast' - plusieurs value.vars DT.c2 = dcast(DT.m2, family_id + age_mother ~ variable, value.var = c("dob", "gender")) DT.c2

source: =====* Attributes are preserved in result wherever possible.=====
fr: =====* Les attributs sont préservés dans le résultat dans la mesure du possible.=====

source: =====* Everything is taken care of internally, and efficiently. In addition to being fast, it is also very memory efficient.=====
fr: =====* Tout est pris en charge de manière interne et efficace. En plus d'être rapide, il est également très économe en mémoire.=====

source: Multiple functions to `fun.aggregate`:
fr: Plusieurs fonctions pour `fun.aggregate` :

source: You can also provide *multiple functions* to `fun.aggregate` to `dcast` for *data.tables*. Check the examples in `?dcast` which illustrates this functionality.
fr: Vous pouvez également *plusieurs fonctions* à `fun.aggregate` dans `dcast` pour les *data.tables*. Consultez les exemples dans `?dcast` qui illustrent cette fonctionnalité.
