Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-intro.Rmd-*.po
Languages: fr

source: d) Expressions in `by`
fr: d) Expressions de `by`

source: -- Can `by` accept *expressions* as well or does it just take columns?
fr: -- `by` accepte-t-il également *expressions*, ou simplement des colonnes ?

source: Yes it does. As an example, if we would like to find out how many flights started late but arrived early (or on time), started and arrived late etc...
fr: Oui, il le fait. Par exemple, si nous avions voulu chercher combien de vols sont partis en retard mais sont arrivés plus tôt (ou à l'heure), ou parts à l'heure mais arrivés en retard, etc...

source: e) Multiple columns in `j` - `.SD`
fr: e) Colonnes multiples dans `j` - `.SD`

source: -- Do we have to compute `mean()` for each column individually?
fr: -- Faut-il calculer `mean()` pour chaque colonne individuellement ?

source: It is of course not practical to have to type `mean(myCol)` for every column one by one. What if you had 100 columns to average `mean()`?
fr: Bien sûr il n'est pas pratique de devoir entrer `mean(myCol)` pour chaque colonne, une par une. Et s'il fallait faire la moyenne `mean()` sur 100 colonnes ?

source: How can we do this efficiently and concisely? To get there, refresh on [this tip](#tip-1) - *"As long as the `j`-expression returns a `list`, each element of the `list` will be converted to a column in the resulting `data.table`"*. If we can refer to the *data subset for each group* as a variable *while grouping*, we can then loop through all the columns of that variable using the already- or soon-to-be-familiar base function `lapply()`. No new names to learn specific to `data.table`.
fr: Comment faire cela de manière efficace et concise ? Pour y arriver, relisons [ce conseil](#tip-1) - *"Tant que la `j`-expression renvoie une `list`, chaque élément de cette `list` sera converti en une colonne de la `data.table` résultat"*. Si nous pouvons adresser le *sous-ensemble de données de chaque groupe* comme une variable *de regroupement*, nous pourrons ensuite boucler sur toutes les colonnes de cette variables en utilisant la fonction de base familière (ou en passe de le devenir) `lapply()`. Il n'y a pas de nouveaux noms à apprendre particuliers pour `data.table`.

source: Special symbol `.SD`: {#special-SD}
fr: Symbole spécial `.SD`: {#special-SD}

source: `data.table` provides a *special* symbol called `.SD`. It stands for **S**ubset of **D**ata. It by itself is a `data.table` that holds the data for *the current group* defined using `by`.
fr: `data.table` fournit le symbole *spécial* `.SD`. Il tire son nom de **S**ous-ensemble de **D**onnées. C'est une `data.table` qui contient les données du *groupe actuel* tel qu'il a été défini avec `by`.

source: Recall that a `data.table` is internally a `list` as well with all its columns of equal length.
fr: Souvenez-vous qu'une `data.table` est représentée en interne comme une `list` dont toutes les colonnes ont la même longueur.

source: Let's use the [`data.table` `DT` from before](#what-is-datatable-1a) to get a glimpse of what `.SD` looks like.
fr: Utilisons la [`data.table` `DT` précédente](#what-is-datatable-1a) pour avoir un aperçu de ce à quoi ressemble `.SD` .

source: To compute on (multiple) columns, we can then simply use the base R function `lapply()`.
fr: Pour calculer sur uneou plusieurs colonnes vous pouvez utiliser simplement la fonction de base R `lapply()`.

source: We are almost there. There is one little thing left to address. In our `flights` `data.table`, we only wanted to calculate the `mean()` of the two columns `arr_delay` and `dep_delay`. But `.SD` would contain all the columns other than the grouping variables by default.
fr: Nous y sommes presque. Il reste encore une petite chose à régler. Dans notre `data.table` `flights` , nous avons voulu calculer seulement la `mean()` des deux colonnes `arr_delay` et `dep_delay`. Mais `.SD` contiendrait par défaut toutes les colonnes autres que les variables de groupement.

source: -- How can we specify just the columns we would like to compute the `mean()` on?
fr: -- Comment spécifier uniquement les colonnes sur lesquelles nous voulons appliquer `mean()` ?

source: Using the argument `.SDcols`. It accepts either column names or column indices. For example, `.SDcols = c("arr_delay", "dep_delay")` ensures that `.SD` contains only these two columns for each group.
fr: En utilisant l'argument `.SDcols`. Il accepte soit des noms soit des indices de colonnes. Par exemple, `.SDcols = c("arr_delay", "dep_delay")` permet que `.SD` ne comporte que ces deux colonnes pour chaque groupe.

source: Similar to [part g)](#refer_j), you can also specify the columns to remove instead of columns to keep using `-` or `!`. Additionally, you can select consecutive columns as `colA:colB` and deselect them as `!(colA:colB)` or `-(colA:colB)`.
fr: De la même manière que [part g)](#refer_j), vous pouvez également spécifier les colonnes à supprimer au lieu des colonnes à garder en utilisant le `-` ou `!`. De plus, vous pouvez sélectionner des colonnes consécutives avec `colA:colB` et les désélectionner avec `!(colA:colB)` ou `-(colA:colB)`.

source: Now let us try to use `.SD` along with `.SDcols` to get the `mean()` of `arr_delay` and `dep_delay` columns grouped by `origin`, `dest` and `month`.
fr: Maintenant essayons d'utiliser `.SD` avec `.SDcols` pour obtenir la moyenne `mean()` des colonnes `arr_delay` et `dep_delay` groupées par `origin`, `dest` et `month`.

source: f) Subset `.SD` for each group:
fr: f) Extraire `.SD` pour chaque groupe :

source: -- How can we return the first two rows for each `month`?
fr: -- Comment renvoyer les deux premières lignes de chaque `month`?

source: g) Why keep `j` so flexible?
fr: g) Pourquoi garder `j` si flexible ?

source: So that we have a consistent syntax and keep using already existing (and familiar) base functions instead of learning new functions. To illustrate, let us use the `data.table` `DT` that we created at the very beginning under the section [What is a data.table?](#what-is-datatable-1a).
fr: Ainsi nous avons une syntaxe cohérente et continuons l'utilisation de fonctions de base déja existantes (et familières) au lieu d'apprendre de nouvelles fonctions. Pour illustrer cela utilisons la `data.table` `DT` que nous avons créée tout au début dans la section [Qu'est-ce qu'une data.table ?](#what-is-datatable-1a).

source: -- How can we concatenate columns `a` and `b` for each group in `ID`?
fr: -- Comment concaténer les colonnes `a` et `b` pour chaque groupe de `ID` ?

source: -- What if we would like to have all the values of column `a` and `b` concatenated, but returned as a list column?
fr: -- Que se passerait-il si nous voulions avoir toutes les valeurs des colonnes `a` et `b` concaténées, mais renvoyées en tant que colonne de liste ?

source: Once you start internalising usage in `j`, you will realise how powerful the syntax can be. A very useful way to understand it is by playing around, with the help of `print()`.
fr: Une fois que vous commencerez à utiliser `j`, vous découvrirez la puissance de sa syntaxe. Une manière pratique de l'aborder est de la tester en utilisant `print()`.

source: For example:
fr: Par exemple :

source: In (1), for each group, a vector is returned, with length = 6,4,2 here. However, (2) returns a list of length 1 for each group, with its first element holding vectors of length 6,4,2. Therefore, (1) results in a length of `6+4+2 =`r 6+4+2``, whereas (2) returns `1+1+1=`r 1+1+1``.
fr: Dans (1), pour chaque groupe, un vecteur est renvoyé, de longueur = 6,4,2 ici. Néanmoins, (2) renvoie une liste de longueur 1 pour chaque groupe, dont chaque premier élément contient des vecteurs de longueur 6,4,2. C'est pourquoi, (1) a pour longueur totale `6+4+2 =`r 6+4+2``, alors que (2) renvoie `1+1+1=`r 1+1+1``.

source: Summary
fr: Résumé

source: The general form of `data.table` syntax is:
fr: La forme générale de la syntaxe de `data.table` est :

source: We have seen so far that,
fr: Jusqu'ici nous avons vu que,

source: Using `i`:
fr: En utilisant `i` :

source: We can do much more in `i` by keying a `data.table`, which allows for blazing fast subsets and joins. We will see this in the *"Keys and fast binary search based subsets"* and *"Joins and rolling joins"* vignette.
fr: Nous pouvons faire beaucoup plus dans `i` en créant une `data.table` avec clés, ce qui permet de réaliser rapidement les sous-ensembles et les jointures. Nous verrons cela dans les vignettes *"Clés et sous-ensembles basés sur la recherche binaire rapide"* et *"Jointures et jointures liées au temps"*.

source: Using `j`:
fr: En utilisant `j` :

source: Using `by`:
fr: En utilisant `by` :

source: And remember the tip:
fr: Et souvenez-vous du conseil :

source: As long as `j` returns a `list`, each element of the list will become a column in the resulting `data.table`.
fr: Tant que `j` renvoie un objet `list`, chaque élément de la liste va devenir une colonne du `data.table` résultant.

source: We will see how to *add/update/delete* columns *by reference* and how to combine them with `i` and `by` in the next vignette.
fr: Nous verrons dans la vignette suivante comment *ajouter / mettre à jour / supprimer* des colonnes *par référence* et comment les combiner avec `i` et `by` .

source: title: "Introduction to data.table" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Introduction to data.table} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}
fr: title: "Introduction à data.table" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Introduction à data.table} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}

source: ans <- flights[, .(arr_delay, dep_delay)] head(ans) ## alternatively # ans <- flights[, list(arr_delay, dep_delay)]
fr: ans <- flights[, .(arr_delay, dep_delay)] head(ans) ## forme alternative # ans <- flights[, list(arr_delay, dep_delay)]

source: flights["XYZ"] # Returns: # origin year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time arr_delay carrier flight tailnum ... # 1: XYZ NA NA NA NA NA NA NA NA NA NA NA NA ...
fr: flights["XYZ"] # Retourne: # origin year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time arr_delay carrier flight tailnum ... # 1: XYZ NA NA NA NA NA NA NA NA NA NA NA NA ...

source: flights[origin == "XYZ"] # Returns: # Empty data.table (0 rows and 19 cols): year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,...
fr: flights[origin == "XYZ"] # Retourne: # Empty data.table (0 rows and 19 cols): year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,...

source: flights["XYZ", nomatch=NULL] # Returns: # Empty data.table (0 rows and 19 cols): year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,...
fr: flights["XYZ", nomatch=NULL] # Retourne: # Empty data.table (0 rows and 19 cols): year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,...

source: DF = data.frame(x = c(1,1,1,2,2,3,3,3), y = 1:8) ## (1) normal way DF[DF$x > 1, ] # data.frame needs that ',' as well ## (2) using with DF[with(DF, x > 1), ]
fr: DF = data.frame(x = c(1,1,1,2,2,3,3,3), y = 1:8) ## (1) méthode classique DF[DF$x > 1, ] # data.frame needs that ',' as well ## (2) en utilisant with DF[with(DF, x > 1), ]

source: ans <- flights[, .(.N), by = .(origin)] ans ## or equivalently using a character vector in 'by' # ans <- flights[, .(.N), by = "origin"]
fr: ans <- flights[, .(.N), by = .(origin)] ans ## ou résultat identique en utilisant un vecteur de chaînes de caractères dans 'by' # ans <- flights[, .(.N), by = "origin"]

source: ans <- flights[carrier == "AA", .N, by = .(origin, dest)] head(ans) ## or equivalently using a character vector in 'by' # ans <- flights[carrier == "AA", .N, by = c("origin", "dest")]
fr: ans <- flights[carrier == "AA", .N, by = .(origin, dest)] head(ans) ## ou résultat identique en utilisant une chaîne de caractères dans 'by' # ans <- flights[carrier == "AA", .N, by = c("origin", "dest")]

source: flights[carrier == "AA", ## Only on trips with carrier "AA" lapply(.SD, mean), ## compute the mean by = .(origin, dest, month), ## for every 'origin,dest,month' .SDcols = c("arr_delay", "dep_delay")] ## for just those specified in .SDcols
fr: flights[carrier == "AA", ## Seulement les vols sur porteurs "AA" lapply(.SD, mean), ## calcule la moyenne by = .(origin, dest, month), ## pour chaque 'origin,dest,month' .SDcols = c("arr_delay", "dep_delay")] ## pour seulement ceux spécifiés dans .SDcols

source: ## look at the difference between DT[, print(c(a,b)), by = ID] # (1) ## and DT[, print(list(c(a,b))), by = ID] # (2)
fr: ## inspectez la différence entre DT[, print(c(a,b)), by = ID] # (1) ## et DT[, print(list(c(a,b))), by = ID] # (2)

source: Hence, the argument name `with` in `data.table`. Setting `with = FALSE` disables the ability to refer to columns as if they are variables, thereby restoring the "`data.frame` mode".
fr: D'où le nom de l'argument `with` dans `data.table`. Mettre `with = FALSE` désactive la possibilité de se référer aux colonnes comme si elles étaient des variables, restaurant ainsi le « mode `data.frame` ».

source: ```{chunk_with_args} #===== r eval = FALSE ## not run # returns all columns except arr_delay and dep_delay ans <- flights[, !c("arr_delay", "dep_delay")] # or ans <- flights[, -c("arr_delay", "dep_delay")] ```
fr: ```{chunk_with_args} #===== r eval = FALSE ## pas d'exécution # renvoie toutes les colonnes sauf arr_delay et dep_delay ans <- flights[, !c("arr_delay", "dep_delay")] # ou ans <- flights[, -c("arr_delay", "dep_delay")] ```

source: ```{chunk_with_args} #===== r eval = FALSE ## not run # returns year,month and day ans <- flights[, year:day] # returns day, month and year ans <- flights[, day:year] # returns all columns except year, month and day ans <- flights[, -(year:day)] ans <- flights[, !(year:day)] ``` This is particularly handy while working interactively.
fr: ```{chunk_with_args} #===== r eval = FALSE ## pas d'exécution # renvoie year,month et day ans <- flights[, year:day] # renvoie day, month et year ans <- flights[, day:year] # renvoie toutes les colonnes sauf year, month et day ans <- flights[, -(year:day)] ans <- flights[, !(year:day)] ``` Ceci est particulièrement pratique lorsque l'on travaille de manière interactive.

source: ```{r} ans <- flights[, .N, by = origin] ans ``` We'll use this convenient form wherever applicable hereafter.
fr: ```{r} ans <- flights[, .N, by = origin] ans ``` Nous utiliserons cette forme pratique chaque fois que cela sera possible.

source: =====* *concise* and *consistent* syntax irrespective of the set of operations you would like to perform to achieve your end goal.=====
fr: =====* syntaxe *concise* et *cohérente* quel que soit l'ensemble des opérations que vous souhaitez effectuer pour atteindre votre objectif final.=====

source: =====* performing analysis *fluidly* without the cognitive burden of having to map each operation to a particular function from a potentially huge set of functions available before performing the analysis.=====
fr: =====* effectuer une analyse *fluide* sans la charge cognitive de devoir faire correspondre chaque opération à une fonction particulière à partir d'un ensemble potentiellement énorme de fonctions disponibles avant d'effectuer l'analyse.=====

source: =====* *automatically* optimising operations internally and very effectively by knowing precisely the data required for each operation, leading to very fast and memory-efficient code.=====
fr: =====* *automatiquement* optimiser les opérations en interne et de manière très efficace en connaissant précisément les données requises pour chaque opération, ce qui permet d'obtenir un code très rapide et efficace sur le plan de la mémoire.=====

source: =====1. Start with the basics - what is a `data.table`, its general form, how to *subset* rows, how to *select and compute* on columns;=====
fr: =====1. Commencez par les bases - qu'est-ce qu'un `data.table`, sa forme générale, comment réaliser un *sous-ensemble* des lignes, comment *sélectionner et effectuer des calculs* sur les colonnes;=====

source: =====2. Then we will look at performing data aggregations by group=====
fr: =====2. Nous verrons ensuite comment effectuer des agrégations de données par groupe=====

source: =====* Row numbers are printed with a `:` in order to visually separate the row number from the first column.=====
fr: =====* Les numéros de ligne sont imprimés avec un `:` afin de séparer visuellement le numéro de ligne de la première colonne.=====

source: =====* When the number of rows to print exceeds the global option `datatable.print.nrows` (default = `r getOption("datatable.print.nrows")`), it automatically prints only the top 5 and bottom 5 rows (as can be seen in the [Data](#data) section). For a large `data.frame`, you may have found yourself waiting around while larger tables print-and-page, sometimes seemingly endlessly. This restriction helps with that, and you can query the default number like so:=====
fr: =====* Lorsque le nombre de lignes à imprimer dépasse l'option globale `datatable.print.nrows` (défaut = `r getOption("datatable.print.nrows")`), il n'imprime automatiquement que les 5 premières et les 5 dernières lignes (comme on peut le voir dans la section [Data](#data)). Pour un grand `data.frame`, vous avez pu vous retrouver à attendre que des tables plus grandes s'impriment et se mettent en page, parfois sans fin. Cette restriction permet d'y remédier, et vous pouvez demander le nombre par défaut de la façon suivante : =====

source: =====* `data.table` doesn't set or use *row names*, ever. We will see why in the *"Keys and fast binary search based subset"* vignette.=====
fr: =====* `data.table` ne définit ni n'utilise jamais de *nom de ligne*. Nous verrons pourquoi dans la vignette *"Sous-ensemble basé sur des clés et recherche binaire rapide"*.=====

source: =====* The *row indices* that satisfy the condition `origin == "JFK" & month == 6L` are computed, and since there is nothing else left to do, all columns from `flights` at rows corresponding to those *row indices* are simply returned as a `data.table`.=====
fr: =====* Les *indices de ligne* qui satisfont la condition `origin == "JFK" & month == 6L` sont calculés, et puisqu'il n'y a rien d'autre à faire, toutes les colonnes de `flights` aux lignes correspondant à ces *indices de ligne* sont simplement renvoyées sous forme d’un `data.table`.=====

source: =====* A comma after the condition in `i` is not required. But `flights[origin == "JFK" & month == 6L, ]` would work just fine. In a `data.frame`, however, the comma is necessary.=====
fr: =====* Une virgule après la condition dans `i` n'est pas nécessaire. Mais `flights[origin == "JFK" & month == 6L, ]` fonctionnerait parfaitement. Avec un `data.frame`, cependant, la virgule est indispensable.=====

source: =====* In this case, there is no condition. The row indices are already provided in `i`. We therefore return a `data.table` with all columns from `flights` at rows for those *row indices*.=====
fr: =====* Dans ce cas, il n'y a pas de condition. Les indices des lignes sont déjà fournis dans `i`. Nous retournons donc un `data.table` avec toutes les colonnes de `flights` aux lignes pour ces *index de ligne*.=====

source: =====* We can use "-" on `character` columns within the frame of a `data.table` to sort in decreasing order.=====
fr: =====* Nous pouvons utiliser "-" sur les colonnes `character` dans le cadre d'un `data.table` pour trier par ordre décroissant.=====

source: =====* In addition, `order(...)` within the frame of a `data.table` uses `data.table`'s internal fast radix order `forder()`. This sort provided such a compelling improvement over R's `base::order` that the R project adopted the `data.table` algorithm as its default sort in 2016 for R 3.3.0 (for reference, check `?sort` and the [R Release NEWS](https://cran.r-project.org/doc/manuals/r-release/NEWS.pdf)).=====
fr: =====* De plus, `order(...)` dans le cadre d'un `data.table` utilise l'ordre radix rapide interne de `data.table` `forder()`. Ce tri a apporté une telle amélioration par rapport à `base::order` de R que le projet R a adopté l'algorithme `data.table` comme tri par défaut en 2016 pour R 3.3.0 (pour référence, voir `?sort` et les [R Release NEWS](https://cran.r-project.org/doc/manuals/r-release/NEWS.pdf)).=====

source: =====* Since columns can be referred to as if they are variables within the frame of a `data.table`, we directly refer to the *variable* we want to subset. Since we want *all the rows*, we simply skip `i`.=====
fr: =====* Puisque les colonnes peuvent être appelées comme si elles étaient des variables dans le cadre d'un `data.table`, nous nous référons directement à la *variable* dont nous voulons créer un sous-ensemble. Puisque nous voulons *toutes les lignes*, nous sautons simplement `i`.=====

source: =====* It returns *all* the rows for the column `arr_delay`.=====
fr: =====* Il renvoie *toutes* les lignes de la colonne `arr_delay`.=====

source: =====* We wrap the *variables* (column names) within `list()`, which ensures that a `data.table` is returned. In the case of a single column name, not wrapping with `list()` returns a vector instead, as seen in the [previous example](#select-j-1d).=====
fr: =====* Nous enveloppons les *variables* (noms de colonnes) dans `list()`, ce qui assure qu'un `data.table` est retourné. Dans le cas d'un seul nom de colonne, le fait de ne pas utiliser `list()` renvoie un vecteur, comme on peut le voir dans l'exemple précédent](#select-j-1d).=====

source: =====* `data.table` also allows wrapping columns with `.()` instead of `list()`. It is an *alias* to `list()`; they both mean the same. Feel free to use whichever you prefer; we have noticed most users seem to prefer `.()` for conciseness, so we will continue to use `.()` hereafter.=====
fr: =====* `data.table` permet aussi d'envelopper les colonnes avec `.()` au lieu de `list()`. C'est un *alias* de `list()` ; les deux signifient la même chose. N'hésitez pas à utiliser ce que vous préférez ; nous avons remarqué que la plupart des utilisateurs semblent préférer `.()` pour la concision, donc nous continuerons à utiliser `.()` par la suite.=====

source: =====* Wrap both columns within `.()`, or `list()`. That's it.=====
fr: =====* Enveloppez les deux colonnes dans `.()`, ou `list()`. C'est tout.=====

source: =====* `data.table`'s `j` can handle more than just *selecting columns* - it can handle *expressions*, i.e., *computing on columns*. This shouldn't be surprising, as columns can be referred to as if they are variables. Then we should be able to *compute* by calling functions on those variables. And that's what precisely happens here.=====
fr: =====* Le `j` de `data.table` peut gérer plus que la *sélection de colonnes* - il peut gérer des *expressions*, c'est-à-dire *calculer sur des colonnes*. Cela ne devrait pas être surprenant, car on peut se référer aux colonnes comme si elles étaient des variables. Nous devrions donc pouvoir *calculer* en appelant des fonctions sur ces variables. Et c'est précisément ce qui se passe ici.=====

source: =====* We first subset in `i` to find matching *row indices* where `origin` airport equals `"JFK"`, and `month` equals `6L`. We *do not* subset the *entire* `data.table` corresponding to those rows *yet*.=====
fr: =====* Nous commençons par effectuer un sous-ensemble dans `i` pour trouver les *indices de ligne* correspondants à `origin` égal à l’aéroport `"JFK"`, et où le `mois` est égal à `6L`. Nous *n'effectuons pas encore* le sous-ensemble de *toutes* les `data.table` correspondant à ces lignes.=====
