Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-keys-fast-subset.Rmd-*.po
Languages: fr

source: =====* We first set `key` to `hour`. This reorders `flights` by the column `hour` and marks that column as the `key` column.=====
fr: =====* Nous définissons d'abord la clé (`key`) sur `hour`. Cela réorganise `flights` en fonction de la colonne `hour` et marque cette colonne comme `clé`.=====

source: =====* Now we can subset on `hour` by using the `.()` notation. We subset for the value *24* and obtain the corresponding *row indices*.=====
fr: =====* Nous pouvons maintenant faire un sous-ensemble sur `hour` en utilisant la notation `.()`. Nous extrayons les valeurs pour *24* et obtenons les *indices des lignes* correspondants.=====

source: =====* And on those row indices, we replace the `key` column with the value `0`.=====
fr: =====* Et sur ces indices de lignes, nous remplaçons la colonne `clé` par la valeur `0`.=====

source: =====* Since we have replaced values on the *key* column, the *data.table* `flights` isn't sorted by `hour` anymore. Therefore, the key has been automatically removed by setting to NULL.=====
fr: =====* Comme nous avons remplacé les valeurs de la colonne *clé*, le *data.table* `flights` n'est plus triée par `hour`. Par conséquent, la clé a été automatiquement supprimée en la définissant sur NULL.=====

source: Now, there shouldn't be any *24* in the `hour` column.
fr: Maintenant, Il ne devrait plus y avoir de *24* dans la colonne `hour`.

source: e) Aggregation using `by`
fr: e) Agrégation avec `by`

source: Let's set the key back to `origin, dest` first.
fr: Remettons d'abord la clé sur `origin, dest`.

source: -- Get the maximum departure delay for each `month` corresponding to `origin = "JFK"`. Order the result by `month`
fr: -- Obtenir le retard maximum de départ pour chaque mois (`month`) correspondant à `origin = "JFK"`. Classer les résultats par `mois`

source: =====* We subset on the `key` column *origin* to obtain the *row indices* corresponding to *"JFK"*.=====
fr: =====* Nous extrayons un sous-ensemble à partir de la colonne `clé` *origin* pour obtenir les *indices des lignes* correspondant à *"JFK"*.=====

source: =====* Once we obtain the row indices, we only need two columns - `month` to group by and `dep_delay` to obtain `max()` for each group. *data.table's* query optimisation therefore subsets just those two columns corresponding to the *row indices* obtained in `i`, for speed and memory efficiency.=====
fr: =====* Une fois que nous avons obtenu les indices des lignes, nous n'avons besoin que de deux colonnes - `month` pour grouper et `dep_delay` pour obtenir `max()` pour chaque groupe. L'optimisation des requêtes de *data.table* permet d'extraire un sous-ensemble juste à partir de ces deux colonnes, correspondant aux *indices de lignes* obtenus dans `i`, pour la rapidité et l'efficacité mémoire.=====

source: =====* And on that subset, we group by *month* and compute `max(dep_delay)`.=====
fr: =====* Et sur ce sous-ensemble, nous regroupons par *mois* (*month*) et calculons `max(dep_delay)`.=====

source: =====* We use `keyby` to automatically key that result by *month*. Now we understand what that means. In addition to ordering, it also sets *month* as the `key` column.=====
fr: =====* Nous utilisons `keyby` pour définir automatiquement cette clé par *mois*. Nous comprenons maintenant ce que cela signifie. En plus de l'ordre, cela définit *month* comme la colonne `key`.=====

source: 3. Additional arguments - `mult` and `nomatch`
fr: 3. Arguments supplémentaires - `mult` et `nomatch`

source: a) The *mult* argument
fr: g) L'argument *mult*

source: We can choose, for each query, if *"all"* the matching rows should be returned, or just the *"first"* or *"last"* using the `mult` argument. The default value is *"all"* - what we've seen so far.
fr: Nous pouvons choisir, pour chaque requête, si *"toutes"* les lignes correspondantes doivent être retournées, ou seulement la *"première"* ou la *"dernière"* en utilisant l'argument `mult`. La valeur par défaut est *"all"* - ce que nous avons vu jusqu'à présent.

source: -- Subset only the first matching row from all rows where `origin` matches *"JFK"* and `dest` matches *"MIA"*
fr: -- Extraire uniquement la première ligne correspondante parmi toutes les lignes où `origin` correspond à *"JFK"* et `dest` correspond à *"MIA"*

source: -- Subset only the last matching row of all the rows where `origin` matches *"LGA", "JFK", "EWR"* and `dest` matches *"XNA"*
fr: -- Extraire uniquement la dernière ligne correspondante parmi toutes les lignes où `origin` correspond à *"LGA", "JFK", "EWR"* et `dest` correspond à *"XNA"*

source: =====* The query *"JFK", "XNA"* doesn't match any rows in `flights` and therefore returns `NA`.=====
fr: =====* La requête *"JFK", "XNA"* ne correspond à aucune ligne dans `flights` et renvoie donc `NA`.=====

source: =====* Once again, the query for second key column `dest`, *"XNA"*, is recycled to fit the length of the query for first key column `origin`, which is of length 3.=====
fr: =====* Encore une fois, la requête pour la deuxième colonne clé `dest`, *"XNA"*, est réutilisée pour correspondre à la longueur de la requête pour la première colonne clé `origin`, qui est de longueur de 3.=====

source: b) The *nomatch* argument
fr: b) L'argument *nomatch*

source: We can choose if queries that do not match should return `NA` or be skipped altogether using the `nomatch` argument.
fr: Nous pouvons choisir si les requêtes qui ne correspondent pas doivent renvoyer `NA` ou être ignorées en utilisant l'argument `nomatch`.

source: -- From the previous example, Subset all rows only if there's a match
fr: -- D'après l'exemple précédent, extraire toutes les lignes uniquement si elles correspondent

source: =====* Default value for `nomatch` is `NA`. Setting `nomatch = NULL` skips queries with no matches.=====
fr: =====* La valeur par défaut de `nomatch` est `NA`. En définissant `nomatch = NULL`, on ignore les requêtes qui n'ont pas de correspondance.=====

source: =====* The query “JFK”, “XNA” doesn’t match any rows in flights and therefore is skipped.=====
fr: =====* La requête "JFK", "XNA" ne correspond à aucune ligne dans `flights` et est donc ignorée.=====

source: 4. binary search vs vector scans
fr: 4. recherche binaire vs balayage vectoriel

source: We have seen so far how we can set and use keys to subset. But what's the advantage? For example, instead of doing:
fr: Nous avons vu jusqu'à présent comment définir et utiliser des clés pour extraire des sous-ensembles. Mais quel est l'avantage ? Par exemple, au lieu de faire :

source: #===== r eval = FALSE # key by origin,dest columns flights[.("JFK", "MIA")]
fr: #===== r eval = FALSE # clé par origin,dest columns flights[.("JFK", "MIA")]

source: we could have done:
fr: nous aurions pu faire :

source: One advantage very likely is shorter syntax. But even more than that, *binary search based subsets* are **incredibly fast**.
fr: Un avantage évident est d'avoir une syntaxe plus courte. Mais plus encore, *extraire des sous-ensembles basés par recherche binaire* est **incroyablement rapide**.

source: As the time goes `data.table` gets new optimization and currently the latter call is automatically optimized to use *binary search*. To use slow *vector scan* key needs to be removed.
fr: Au fil du temps, `data.table` bénéficie de nouvelles optimisations et actuellement, obtenir un sous-ensemble basé sur cette méthode applique automatiquement la *recherche binaire*. Afin d'utiliser la méthode lente par *balayage vectoriel*, la clé doit être supprimée.

source: a) Performance of binary search approach
fr: a) Performance de l'approche par recherche binaire

source: To illustrate, let's create a sample *data.table* with 20 million rows and three columns and key it by columns `x` and `y`.
fr: Pour illustrer cela, créons un *data.table* avec 20 millions de lignes et trois colonnes, avec pour clés les colonnes `x` et `y`.

source: `DT` is ~380MB. It is not really huge, but this will do to illustrate the point.
fr: `DT` est de ~380Mo. Ce n'est pas vraiment énorme, mais suffisant pour illustrer le propos.

source: From what we have seen in the Introduction to data.table section, we can subset those rows where columns `x = "g"` and `y = 877` as follows:
fr: D'après ce que nous avons vu dans la section Introduction à data.table, nous pouvons faire un sous-ensemble des lignes où les colonnes `x = "g"` et `y = 877` comme suit :

source: key(DT) ## (1) Usual way of subsetting - vector scan approach t1 <- system.time(ans1 <- DT[x == "g" & y == 877L]) t1 head(ans1) dim(ans1)
fr: key(DT) ## (1) Méthode habituelle pour extraire un sous-ensemble - approche par balayage vectoriel t1 <- system.time(ans1 <- DT[x == "g" & y == 877L]) t1 head(ans1) dim(ans1)

source: Now let's try to subset by using keys.
fr: Essayons maintenant de faire un sous-ensemble en utilisant des clés.

source: setkeyv(DT, c("x", "y")) key(DT) ## (2) Subsetting using keys t2 <- system.time(ans2 <- DT[.("g", 877L)]) t2 head(ans2) dim(ans2) identical(ans1$val, ans2$val)
fr: setkeyv(DT, c("x", "y")) key(DT) ## (2) Sous-ensemble à l'aide de clés t2 <- system.time(ans2 <- DT[.("g", 877L)]) t2 head(ans2) dim(ans2) identical(ans1$val, ans2$val)

source: =====* The speed-up is **~`r round(t1[3]/max(t2[3], .001))`x**!=====
fr: =====* Le gain de vitesse est d'envrion **~`r round(t1[3]/max(t2[3], .001))`x**!=====

source: b) Why does keying a *data.table* result in blazing fast subsets?
fr: b) Pourquoi le fait de définir une clé pour une *data.table* permet-il d'obtenir des sous-ensembles extrêmement rapides ?

source: To understand that, let's first look at what *vector scan approach* (method 1) does.
fr: Pour comprendre cela, examinons d'abord ce que fait l'approche par *balayage vectoriel* (méthode 1).

source: Vector scan approach
fr: Approche par balayage vectoriel

source: =====* The column `x` is searched for the value *"g"* row by row, on all 20 million of them. This results in a *logical vector* of size 20 million, with values `TRUE, FALSE or NA` corresponding to `x`'s value.=====
fr: =====* La colonne `x` est parcourue ligne par ligne pour rechercher la valeur *"g"* parmi les 20 millions de lignes. Cela produit un *vecteur logique* de taille 20 millions, avec les valeurs `TRUE, FALSE ou NA` correspondant à la valeur de `x`.=====

source: =====* Similarly, the column `y` is searched for `877` on all 20 million rows one by one, and stored in another logical vector.=====
fr: =====* De même, la colonne `y` est parcourue pour rechercher la valeur `877` parmi les 20 millions de lignes, et les résultats sont stockés dans un autre vecteur logique.=====

source: =====* Element wise `&` operations are performed on the intermediate logical vectors and all the rows where the expression evaluates to `TRUE` are returned.=====
fr: =====* Ensuite, une opération élément par élément `&` est effectuée sur les vecteurs logiques intermédiaires et toutes les lignes où l'expression est évaluée à `TRUE` sont renvoyées.=====

source: This is what we call a *vector scan approach*. And this is quite inefficient, especially on larger tables and when one needs repeated subsetting, because it has to scan through all the rows each time.
fr: C'est ce que nous appelons une *approche par balayage vectoriel*. Cette méthode est assez inefficace, en particulier pour les tableaux volumineux ou lorsque des sous-ensembles doivent être créés de manière répétée, car elle doit parcourir toutes les lignes à chaque fois.

source: Now let us look at binary search approach (method 2). Recall from [Properties of key](#key-properties) - *setting keys reorders the data.table by key columns*. Since the data is sorted, we don't have to *scan through the entire length of the column*! We can instead use *binary search* to search a value in `O(log n)` as opposed to `O(n)` in case of *vector scan approach*, where `n` is the number of rows in the *data.table*.
fr: Examinons maintenant l'approche de la recherche binaire (méthode 2). Rappelons que dans [Les clés et leurs propriétés](#key-properties) - *lorsque l’on définit des clés, cela réorganise la data.table selon les colonnes clés*. Étant donné que les données sont triées, nous n'avons pas besoin de *parcourir toute la longueur de la colonne* ! Nous pouvons utiliser *la recherche binaire* pour rechercher une valeur en `O(log n)` au lieu de `O(n)` dans le cas de *l'approche par balayage vectoriel*, où `n` est le nombre de lignes dans la *data.table*.

source: Binary search approach
fr: Approche par recherche binaire

source: Here's a very simple illustration. Let's consider the (sorted) numbers shown below:
fr: Prenons un exemple très simple. Considérons les nombres (triés) ci-dessous :

source: Suppose we'd like to find the matching position of the value *1*, using binary search, this is how we would proceed - because we know that the data is *sorted*.
fr: Supposons que nous voulions trouver la position correspondant à la valeur *1*, en utilisant la recherche binaire. Voici comment nous procéderions -(en sachant que les données sont *triées*).

source: =====* Start with the middle value = 19. Is 1 == 19? No. 1 < 19.=====
fr: =====* Commencez par la valeur du milieu = 19. Est-ce que 1 == 19 ? Non. 1 < 19.=====

source: =====* Since the value we're looking for is smaller than 19, it should be somewhere before 19. So we can discard the rest of the half that are >= 19.=====
fr: =====* Comme la valeur recherchée est plus petite que 19, elle doit se trouver quelque part avant 19. Nous pouvons donc écarter le reste de la moitié qui est >= 19.=====

source: =====* Our set is now reduced to *1, 5, 10*. Grab the middle value once again = 5. Is 1 == 5? No. 1 < 5.=====
fr: =====* Notre ensemble est maintenant réduit à *1, 5, 10*. Prenons à nouveau la valeur centrale = 5. Est-ce que 1 == 5 ? Non. 1 < 5.=====

source: =====* Our set is reduced to *1*. Is 1 == 1? Yes. The corresponding index is also 1. And that's the only match.=====
fr: =====* Notre ensemble est réduit à *1*. Est-ce que 1 == 1 ? Oui. L'indice correspondant est également 1. Et c'est la seule correspondance.=====

source: A vector scan approach on the other hand would have to scan through all the values (here, 7).
fr: Avec une approche de balayage vectoriel, nous aurions dû parcourir toutes les valeurs (ici, 7 valeurs).

source: It can be seen that with every search we reduce the number of searches by half. This is why *binary search* based subsets are **incredibly fast**. Since rows of each column of *data.tables* have contiguous locations in memory, the operations are performed in a very cache efficient manner (also contributes to *speed*).
fr: On peut constater qu'à chaque recherche, le nombre de recherches est réduit de moitié. C'est pourquoi la construction de sous-ensembles en utilisant la recherche binaire est **incroyablement rapide**. Étant donné que les lignes de chaque colonne des *data.tables* sont stockées de manière contiguë en mémoire, les opérations sont effectuées de manière très efficace en termes de cache (ce qui contribue également à la *vitesse*).

source: In addition, since we obtain the matching row indices directly without having to create those huge logical vectors (equal to the number of rows in a *data.table*), it is quite **memory efficient** as well.
fr: De plus, comme nous obtenons directement les indices des lignes correspondantes sans avoir à créer ces énormes vecteurs logiques (égal au nombre de lignes d'un *data.table*), cette méthode est également très **très efficace en termes de mémoire**.

source: Summary
fr: Résumé

source: In this vignette, we have learnt another method to subset rows in `i` by keying a *data.table*. Setting keys allows us to perform blazing fast subsets by using *binary search*. In particular, we have seen how to
fr: Dans cette vignette, nous avons appris une autre méthode pour subdiviser les lignes dans `i` en utilisant les clés d'une *data.table*. Définir des clés nous permet de créer des sous-ensembles extrêmement rapidement en utilisant la *recherche binaire*. En particulier, nous avons vu comment

source: =====* set key and subset using the key on a *data.table*.=====
fr: =====* définir une clé et utiliser cette clé pour créer des sous-ensembles dans une *data.table*.=====

source: =====* subset using keys which fetches *row indices* in `i`, but much faster.=====
fr: =====* utiliser les clés pour obtenir des *indices de lignes* en `i`, mais beaucoup plus rapidement.=====

source: =====* combine key based subsets with `j` and `by`. Note that the `j` and `by` operations are exactly the same as before.=====
fr: =====* combiner les sous-ensembles basés sur les clés avec `j` et `by`. Notez que les opérations `j` et `by` sont exactement les mêmes que précédemment.=====

source: Key based subsets are **incredibly fast** and are particularly useful when the task involves *repeated subsetting*. But it may not be always desirable to set key and physically reorder the *data.table*. In the next vignette, we will address this using a *new* feature -- *secondary indexes*.
fr: La création de sous-ensembles basés sur les clés est **incroyablement rapide** et particulièrement utile lorsque la tâche implique de créer des *sous-ensembles de manière répété*. Cependant, il peut ne pas toujours être souhaitable de définir une clé et de réorganiser physiquement la *data.table*. Dans la prochaine vignette, nous aborderons ce problème en utilisant une *nouvelle* fonctionnalité -- les *indices secondaires*.
