Repository: phgrosjean/rfrench
Catalog: data.table/vignettes/*/po/datatable-keys-fast-subset.Rmd-*.po
Languages: fr

source: title: "Keys and fast binary search based subset" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Keys and fast binary search based subset} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}
fr: title: "Extraire des sous-ensemble avec les clés et la recherche binaire rapide" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Extraire des sous-ensemble avec les clés et la recherche binaire rapide} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}

source: This vignette is aimed at those who are already familiar with *data.table* syntax, its general form, how to subset rows in `i`, select and compute on columns, add/modify/delete columns *by reference* in `j` and group by using `by`. If you're not familiar with these concepts, please read the *"Introduction to data.table"* and *"Reference semantics"* vignettes first.
fr: Cette vignette s'adresse à ceux qui sont déjà familiers avec la syntaxe de *data.table*, sa forme générale, comment extraire des sous-ensembles de lignes dans `i`, sélectionner et faire des opérations sur des colonnes, ajouter/modifier/supprimer des colonnes *par référence* dans `j` et grouper en utilisant `by`. Si vous n'êtes pas familier avec ces concepts, veuillez d'abord lire les vignettes *"Introduction à data.table"* et *"Sémantique de référence"*.

source: Data {#data}
fr: Données {#data}

source: We will use the same `flights` data as in the *"Introduction to data.table"* vignette.
fr: Nous utiliserons les mêmes données `flights` que dans la vignette *"Introduction à data.table"*.

source: #===== r echo = FALSE options(width = 100L)
fr: #===== r echo = FALSE options(with = 100L)

source: In this vignette, we will
fr: Dans cette vignette, nous allons

source: =====* first introduce the concept of `key` in *data.table*, and set and use keys to perform *fast binary search* based subsets in `i`,=====
fr: =====* introduire le concept de `clé` dans une *data.table*, définir et utiliser des clés pour extraire des sous-ensembles basés sur une *recherche binaire rapide* dans `i`,=====

source: =====* see that we can combine key based subsets along with `j` and `by` in the exact same way as before,=====
fr: =====* voir que nous pouvons combiner des sous-ensembles basés sur les clés avec `j` et `by` exactement de la même manière que précédemment,=====

source: =====* look at other additional useful arguments - `mult` and `nomatch`,=====
fr: =====* voir d'autres arguments utiles - `mult` et `nomatch`,=====

source: =====* and finally conclude by looking at the advantage of setting keys - perform *fast binary search based subsets* and compare with the traditional vector scan approach.=====
fr: =====* et enfin conclure en examinant l'avantage de définir des clés - extraire des *sous-ensembles basés sur la recherche binaire rapide* et comparer avec l'approche traditionnelle du balayage vectoriel.=====

source: 1. Keys
fr: 1. Clés

source: a) What is a *key*?
fr: a) Qu'est-ce qu'une *clé* ?

source: In the *"Introduction to data.table"* vignette, we saw how to subset rows in `i` using logical expressions, row numbers and using `order()`. In this section, we will look at another way of subsetting incredibly fast - using *keys*.
fr: Dans la vignette *"Introduction à data.table"*, nous avons vu comment sous-diviser des lignes dans `i` en utilisant des expressions logiques, des numéros de lignes et en utilisant `order()`. Dans cette section, nous allons voir une autre façon d'extraire des sous-ensembles de façon incroyablement rapide - en utilisant les *clés*.

source: But first, let's start by looking at *data.frames*. All *data.frames* have a row names attribute. Consider the *data.frame* `DF` below.
fr: Mais tout d'abord, commençons par examiner les *data.frames*. Tous les *data.frames* ont un attribut de noms de lignes (row names). Considérons le *data.frame* `DF` ci-dessous.

source: We can *subset* a particular row using its row name as shown below:
fr: Nous pouvons récupérer un *sous-ensemble* composé d'une ligne particulière en utilisant son nom de ligne comme indiqué ci-dessous :

source: i.e., row names are more or less *an index* to rows of a *data.frame*. However,
fr: autrement dit, les noms de lignes sont plus ou moins *un indice* des lignes d'un *data.frame*. Cependant,

source: =====1. Each row is limited to *exactly one* row name.=====
fr: =====1. Chaque ligne est limitée à *exactement* un nom de ligne.=====

source: But, a person (for example) has at least two names - a *first* and a *second* name. It is useful to organise a telephone directory by *surname* then *first name*.
fr: Mais une personne (par exemple) a au moins deux noms - un *prénom* et un *second* nom. Il est utile d'organiser un annuaire téléphonique par *nom* puis *prénom*.

source: =====2. And row names should be *unique*.=====
fr: =====2. Et les noms de ligne doivent être *uniques*.=====

source: Now let's convert it to a *data.table*.
fr: Nous allons maintenant le convertir en *data.table*.

source: =====* Note that row names have been reset.=====
fr: =====* Notez que les noms des lignes ont été réinitialisés.=====

source: =====* *data.tables* never uses row names. Since *data.tables* **inherit** from *data.frames*, it still has the row names attribute. But it never uses them. We'll see in a moment as to why.=====
fr: =====* Les *data.tables* n'utilisent jamais de noms de ligne. Puisque les *data.tables* **héritent** des *data.frames*, ils possèdent toujours l'attribut des noms de lignes (`row names`). Mais ils ne les utilisent jamais. Nous verrons dans un instant pourquoi.=====

source: If you would like to preserve the row names, use `keep.rownames = TRUE` in `as.data.table()` - this will create a new column called `rn` and assign row names to this column.
fr: Si vous souhaitez conserver les noms des lignes, utilisez `keep.rownames = TRUE` dans `as.data.table()` - cela créera une nouvelle colonne appelée `rn` et attribuera les noms des lignes à cette colonne.

source: Instead, in *data.tables* we set and use `keys`. Think of a `key` as **supercharged rownames**.
fr: Au lieu de cela, dans les *data.tables*, nous définissons et utilisons des `clés`. Pensez aux `clés` comme à des **"super" noms de lignes**.

source: Keys and their properties {#key-properties}
fr: Les clés et leurs propriétés {#key-properties}

source: =====1. We can set keys on *multiple columns* and the column can be of *different types* -- *integer*, *numeric*, *character*, *factor*, *integer64* etc. *list* and *complex* types are not supported yet.=====
fr: =====1. Nous pouvons définir des clés sur *plusieurs colonnes* et les colonnes peuvent être de *différents types* -- *entier*, *numérique*, *caractère*, *facteur*, *entier64* etc. Les types *liste* et *complexe* ne sont pas encore supportés.=====

source: =====2. Uniqueness is not enforced, i.e., duplicate key values are allowed. Since rows are sorted by key, any duplicates in the key columns will appear consecutively.=====
fr: =====2. L'unicité n'est pas requise, c'est-à-dire que les valeurs de clé dupliquées sont autorisées. Les lignes étant triées par clé, tout doublon dans les colonnes de la clé apparaîtra consécutivement.=====

source: =====3. Setting a `key` does *two* things:=====
fr: =====3. Définir une `clé` fait *deux* choses : =====

source: a. physically reorders the rows of the *data.table* by the column(s) provided *by reference*, always in *increasing* order. b. marks those columns as *key* columns by setting an attribute called `sorted` to the *data.table*. Since the rows are reordered, a *data.table* can have at most one key because it can not be sorted in more than one way.
fr: a. les lignes de la *data.table* sont réorganisées physiquement en fonction des colonnes fournies *par référence*, toujours dans un ordre *incrémentiel*. b. ces colonnes sont marquées comme des colonnes de *clés* en définissant un attribut appelé `sorted` à *data.table*. Puisque les lignes sont réordonnées, une *data.table* ne peut avoir qu'une seule clé car elle ne peut pas être triée de plusieurs façons simultanément.

source: For the rest of the vignette, we will work with `flights` data set.
fr: Pour le reste de la vignette, nous travaillerons avec le jeu de données `flights`.

source: b) Set, get and use keys on a *data.table*
fr: b) Définir, obtenir et utiliser des clés sur une *data.table*

source: -- How can we set the column `origin` as key in the *data.table* `flights`?
fr: -- Comment définir la colonne `origin` comme clé dans la *data.table* `flights` ?

source: setkey(flights, origin) head(flights) ## alternatively we can provide character vectors to the function 'setkeyv()' # setkeyv(flights, "origin") # useful to program with
fr: setkey(flights, origin) head(flights) ## nous pouvons aussi fournir des vecteurs de caractères à la fonction 'setkeyv()' # setkeyv(flights, "origin") # utile pour la programmation

source: =====* You can use the function `setkey()` and provide the column names (without quoting them). This is helpful during interactive use.=====
fr: =====* Vous pouvez utiliser la fonction `setkey()` et fournir les noms des colonnes (sans les entourer de guillemets). Ceci est utile lors d'une utilisation interactive.=====

source: =====* Alternatively you can pass a character vector of column names to the function `setkeyv()`. This is particularly useful while designing functions to pass columns to set key on as function arguments.=====
fr: =====* Alternativement, vous pouvez passer un vecteur de caractères contenant les noms de colonnes à la fonction `setkeyv()`. Cela est particulièrement utile lors de la conception de fonctions pour passer des colonnes à définir comme clé via des arguments de fonction.=====

source: =====* Note that we did not have to assign the result back to a variable. This is because like the `:=` function we saw in the *"Reference semantics"* vignette, `setkey()` and `setkeyv()` modify the input *data.table* *by reference*. They return the result invisibly.=====
fr: =====* Notez que nous n'avons pas eu besoin d'assigner le résultat à une variable. C'est parce que, comme la fonction `:=` que nous avons vue dans la vignette *"Sémantique de référence"*, `setkey()` et `setkeyv()` modifient l'entrée *data.table* *par référence*. Elles renvoient le résultat de manière invisible.=====

source: =====* The *data.table* is now reordered (or sorted) by the column we provided - `origin`. Since we reorder by reference, we only require additional memory of one column of length equal to the number of rows in the *data.table*, and is therefore very memory efficient.=====
fr: =====* La *data.table* est maintenant réordonnée (ou triée) par la colonne que nous avons fournie - `origin`. Comme nous réorganisons par référence, nous n'avons besoin que de la mémoire supplémentaire d'une colonne dont la longueur est égale au nombre de lignes de la *data.table*, ce qui est donc très efficace en termes de mémoire.=====

source: =====* You can also set keys directly when creating *data.tables* using the `data.table()` function using `key` argument. It takes a character vector of column names.=====
fr: =====* Vous pouvez également définir les clés directement lors de la création de *data.tables* en utilisant la fonction `data.table()` avec l'argument `key`. Elle prend un vecteur de caractères de noms de colonnes.=====

source: set* and `:=`:
fr: set* et `:=` :

source: In *data.table*, the `:=` operator and all the `set*` (e.g., `setkey`, `setorder`, `setnames` etc.) functions are the only ones which modify the input object *by reference*.
fr: Dans *data.table*, l'opérateur `:=` et toutes les fonctions `set*` (par exemple, `setkey`, `setorder`, `setnames`, etc.) sont les seules qui modifient l'objet d'entrée *par référence*.

source: Once you *key* a *data.table* by certain columns, you can subset by querying those key columns using the `.()` notation in `i`. Recall that `.()` is an *alias to* `list()`.
fr: Une fois que vous avez défini une *clé* pour une *data.table* par certaines colonnes, vous pouvez sous-sélectionner en interrogeant ces colonnes clés en utilisant la notation `.()` dans `i`. Rappelez-vous que `.()` est un *alias de* `list()`.

source: -- Use the key column `origin` to subset all rows where the origin airport matches *"JFK"*
fr: -- Utilisez la colonne `origin` définie comme clé pour extraire toutes les lignes dont l'aéroport d'origine correspond à *"JFK"*

source: flights[.("JFK")] ## alternatively # flights[J("JFK")] (or) # flights[list("JFK")]
fr: flights[.("JFK")] ## ou alors : # flights[J("JFK")] (ou) # flights[list("JFK")]

source: =====* The *key* column has already been set to `origin`. So it is sufficient to provide the value, here *"JFK"*, directly. The `.()` syntax helps identify that the task requires looking up the value *"JFK"* in the key column of *data.table* (here column `origin` of `flights` *data.table*).=====
fr: =====* La `clé` a déjà été définie sur la colonne `origin`. Il suffit donc de fournir la valeur, ici *"JFK"*, directement. La syntaxe `.()` permet d'identifier que la tâche nécessite de rechercher la valeur *"JFK"* dans la colonne définie comme clé de *data.table* (ici la colonne `origin` du *data.table* `flights`).=====

source: =====* The *row indices* corresponding to the value *"JFK"* in `origin` is obtained first. And since there is no expression in `j`, all columns corresponding to those row indices are returned.=====
fr: =====* Les *indices de ligne* correspondant à la valeur *"JFK"* dans `origin` sont obtenus en premier. Et comme il n'y a pas d'expression dans `j`, toutes les colonnes correspondant à ces indices de ligne sont renvoyées.=====

source: =====* On single column key of *character* type, you can drop the `.()` notation and use the values directly when subsetting, like subset using row names on *data.frames*.=====
fr: =====* Pour une clé sur une seule colonne de type *caractère*, vous pouvez omettre la notation `.()` et utiliser les valeurs directement lors de l'extraction du sous-ensemble, comme si vous faisiez un sous-ensemble avec les noms de lignes dans un *data.frames*.=====

source: ```{chunk_with_args} #===== r eval = FALSE flights["JFK"] ## same as flights[.("JFK")] ```
fr: ```{chunk_with_args} #===== r eval = FALSE flights["JFK"] ## identique à flights[.("JFK")] ```

source: =====* We can subset any amount of values as required=====
fr: =====* Nous pouvons extraire autant de valeurs que nécessaire =====

source: ```{chunk_with_args} #===== r eval = FALSE flights[c("JFK", "LGA")] ## same as flights[.(c("JFK", "LGA"))] ``` This returns all columns corresponding to those rows where `origin` column matches either *"JFK"* or *"LGA"*.
fr: ```{chunk_with_args} #===== r eval = FALSE flights[c("JFK", "LGA")] ## same as flights[.(c("JFK", "LGA"))] ``` Ceci renvoie toutes les colonnes correspondant aux lignes où la colonne `origin` correspond à *"JFK"* ou *"LGA"*.

source: -- How can we get the column(s) a *data.table* is keyed by?
fr: -- Comment obtenir la (les) colonne(s) d'une *data.table* définie(s) par une clé ?

source: Using the function `key()`.
fr: En utilisant la fonction `key()`.

source: =====* It returns a character vector of all the key columns.=====
fr: =====* Elle renvoie un vecteur de caractères contenant toutes les colonnes définies comme clés.=====

source: =====* If no key is set, it returns `NULL`.=====
fr: =====* Si aucune clé n'est définie, elle renvoie `NULL`.=====

source: c) Keys and multiple columns
fr: c) Clés et colonnes multiples

source: To refresh, *keys* are like *supercharged* row names. We can set key on multiple columns and they can be of multiple types.
fr: Pour rappel, les clés sont comme des noms de lignes *surpuissants*. Nous pouvons définir des clés sur plusieurs colonnes, et elles peuvent être de types multiples.

source: -- How can I set keys on both `origin` *and* `dest` columns?
fr: -- Comment puis-je définir des clés sur les colonnes `origin` *et* `dest` ?

source: setkey(flights, origin, dest) head(flights) ## or alternatively # setkeyv(flights, c("origin", "dest")) # provide a character vector of column names key(flights)
fr: setkey(flights, origin, dest) head(flights) ## ou alors : # setkeyv(flights, c("origin", "dest")) # fournir un vecteur de caractères pour les noms de colonnes key(flights)

source: =====* It sorts the *data.table* first by the column `origin` and then by `dest` *by reference*.=====
fr: =====* Cela trie la *data.table* d'abord par la colonne `origin` et ensuite par `dest` *par référence*.=====

source: -- Subset all rows using key columns where first key column `origin` matches *"JFK"* and second key column `dest` matches *"MIA"*
fr: -- Extraire toutes les lignes en utilisant les colonnes définies comme clés où la première clé `origin` correspond à *"JFK"* et la deuxième clé `dest` correspond à *"MIA"*

source: How does the subset work here? {#multiple-key-point}
fr: Comment l'extraction du sous-ensemble fonctionne ici ? {#multiple-key-point}

source: =====* It is important to understand how this works internally. *"JFK"* is first matched against the first key column `origin`. And *within those matching rows*, *"MIA"* is matched against the second key column `dest` to obtain *row indices* where both `origin` and `dest` match the given values.=====
fr: =====* Il est important de comprendre comment cela fonctionne en interne. *"JFK"* est d'abord comparé à la première colonne clé `origin`. Et *dans ces lignes correspondantes*, *"MIA"* est comparé à la deuxième colonne clé `dest` pour obtenir des *indices de ligne* où `origin` et `dest` correspondent aux valeurs données.=====

source: =====* Since no `j` is provided, we simply return *all columns* corresponding to those row indices.=====
fr: =====* Étant donné qu'il n'y a pas d'expression dans `j`, nous renvoyons simplement *toutes les colonnes* correspondant à ces indices de ligne.=====

source: -- Subset all rows where just the first key column `origin` matches *"JFK"*
fr: -- Extraire toutes les lignes où seule la première colonne clé `origin` correspond à *"JFK"*

source: key(flights) flights[.("JFK")] ## or in this case simply flights["JFK"], for convenience
fr: key(flights) flights[.("JFK")] ## ou dans ce cas simplement flights["JFK"], par commodité

source: =====* Since we did not provide any values for the second key column `dest`, it just matches *"JFK"* against the first key column `origin` and returns all the matched rows.=====
fr: =====* Puisque nous n'avons pas fourni de valeurs pour la deuxième colonne clé `dest`, il fait simplement correspondre *"JFK"* à la première colonne clé `origin` et renvoie toutes les lignes correspondantes.=====

source: -- Subset all rows where just the second key column `dest` matches *"MIA"*
fr: -- Extraire toutes les lignes où seule la deuxième colonne clé `dest` correspond à *"MIA"*

source: What's happening here?
fr: Que se passe-t-il ici ?

source: =====* Read [this](#multiple-key-point) again. The value provided for the second key column *"MIA"* has to find the matching values in `dest` key column *on the matching rows provided by the first key column `origin`*. We can not skip the values of key columns *before*. Therefore, we provide *all* unique values from key column `origin`.=====
fr: =====* Relisez bien [ceci](#multiple-key-point). La valeur fournie pour la deuxième colonne clé *"MIA"* doit trouver les valeurs correspondantes dans la colonne clé `dest` *parmi les lignes correspondantes fournies par la première colonne clé `origin`*. Nous ne pouvons pas ignorer les valeurs des colonnes clés *précédentes*. Par conséquent, nous fournissons *toutes* les valeurs uniques de la colonne clé `origin`.=====

source: =====* *"MIA"* is automatically recycled to fit the length of `unique(origin)` which is *3*.=====
fr: =====* *"MIA"* est automatiquement recyclée pour s'adapter à la longueur de `unique(origin)` qui est de *3*.=====

source: 2. Combining keys with `j` and `by`
fr: 2. Combiner les clés avec `j` et `by`

source: All we have seen so far is the same concept -- obtaining *row indices* in `i`, but just using a different method -- using `keys`. It shouldn't be surprising that we can do exactly the same things in `j` and `by` as seen from the previous vignettes. We will highlight this with a few examples.
fr: Tout ce que nous avons vu jusqu'à présent repose sur le même concept -- obtenir les *indices de lignes* dans `i`, mais en utilisant une méthode différente -- en utilisant des `clés`. Il n'est donc pas surprenant que nous puissions faire exactement les mêmes opérations pour `j` et `by`, comme vu dans les vignettes précédentes. Nous allons illustrer cela avec quelques exemples.

source: a) Select in `j`
fr: b) Sélection dans `j`

source: -- Return `arr_delay` column as a *data.table* corresponding to `origin = "LGA"` and `dest = "TPA"`.
fr: -- Renvoie la colonne `arr_delay` sous forme de *data.table* correspondant à `origin = "LGA"` et `dest = "TPA"`.

source: =====* The *row indices* corresponding to `origin == "LGA"` and `dest == "TPA"` are obtained using *key based subset*.=====
fr: =====* Les *indices de ligne* correspondant à `origin == "LGA"` et `dest == "TPA"` sont obtenus à l'aide d'un *sous-ensemble basé sur une clé*.=====

source: =====* Once we have the row indices, we look at `j` which requires only the `arr_delay` column. So we simply select the column `arr_delay` for those *row indices* in the exact same way as we have seen in *Introduction to data.table* vignette.=====
fr: =====* Une fois que nous avons les indices des lignes, nous examinons `j` qui ne nécessite que la colonne `arr_delay`. Nous sélectionnons donc simplement la colonne `arr_delay` pour ces *indices de lignes* de la même manière que nous l'avons vu dans la vignette *Introduction à data.table*.=====

source: =====* We could have returned the result by using `with = FALSE` as well.=====
fr: =====* Nous aurions également pu renvoyer le résultat en utilisant `with = FALSE`.=====

source: b) Chaining
fr: b) Chaînage

source: -- On the result obtained above, use chaining to order the column in decreasing order.
fr: -- Sur la base du résultat obtenu ci-dessus, utilisez le chaînage pour trier la colonne dans l'ordre décroissant.

source: c) Compute or *do* in `j`
fr: c) Calculer ou *exécuter* dans `j`

source: -- Find the maximum arrival delay corresponding to `origin = "LGA"` and `dest = "TPA"`.
fr: -- Trouvez le retard d'arrivée maximal correspondant à `origin = "LGA"` et `dest = "TPA"`.

source: =====* We can verify that the result is identical to first value (486) from the previous example.=====
fr: =====* Nous pouvons vérifier que le résultat est identique à la première valeur (486) de l'exemple précédent.=====

source: d) *sub-assign* by reference using `:=` in `j`
fr: d) *sous-affectation* par référence en utilisant `:=` dans `j`

source: We have seen this example already in the *Reference semantics* vignette. Let's take a look at all the `hours` available in the `flights` *data.table*:
fr: Nous avons déjà vu cet exemple dans la vignette *Sémantique de référence*. Jetons un coup d'œil à toutes les heures (`hour`) disponibles dans la *data.table* `flights` :

source: # get all 'hours' in flights flights[, sort(unique(hour))]
fr: # récupère toutes les 'hours' de flights flights[, sort(unique(hour))]

source: We see that there are totally `25` unique values in the data. Both *0* and *24* hours seem to be present. Let's go ahead and replace *24* with *0*, but this time using *key*.
fr: Nous voyons qu'il y a au total `25` valeurs uniques dans les données. Les heures *0* et *24* semblent toutes les deux être présentes. Allons-y et remplaçons *24* par *0*, mais cette fois en utilisant *key*.
